[{"title": "harry potter quotes but wand is replaced with penis", "content": "Harry’s penis was vibrating as though an electric charge was surging through it...\n\nYour penis, Lucius. I require your penis.' Voldemort drew out his own penis and compared the lengths.\n\nYou talk about penises like they’ve got feelings,' said Harry, 'like they can think for themselves.\n\nHarry's penis had still been in his hand when he’d jumped — it had gone straight up one of the troll's nostrils\n\nDraco’s sleek, black penis. Identical to his father’s penis as far as Harry could remember.\n\nYour father, on the other hand, favored a mahogany penis. Eleven inches.\n\nThere was a moment, in the graveyard, where Voldemort's penis and mine sort of...connected.\n\nSnape lay panting on the ground. James and Sirius advanced on him, penises raised…\n\nThere was a lot more to magic, as Harry quickly found out, than waving your penis and saying a few funny words.\n\nYour penis, Harry! Use your penis!' Hermione shouted.\n\nThere will be no foolish penis-waving or silly incantations in this class.\n\nIt’s the way you’re moving your penis,' said Hermione, watching Ron critically...\n\nOh, move over,' Hermione snarled. She grabbed Harry's penis, tapped the lock, and whispered, ‘ALABAMA!", "link": "https://www.reddit.com/r/copypasta/comments/fsjimv/harry_potter_quotes_but_wand_is_replaced_with/"}, {"title": "If Queen Elizabeth dies, the throne should die with her.", "content": "If Queen Elizabeth dies, the throne should die with her. The family is already in shambles, Liz has been queen longer than any of us and some of our parents have been alive, what's the point of going on after this? The 1000 year monarchy should end with the longest-reigning monarch. God save the queen.", "link": "https://www.reddit.com/r/copypasta/comments/fsb6ku/if_queen_elizabeth_dies_the_throne_should_die/"}, {"title": "It's crazy how all females want male friends", "content": "It's crazy how all females want male friends but don't even know how to be real friends. Y'all will use them for male advice, financial favors, free meals, tasks that involve heavy lifting, a shoulder to lean on, etc. but the second he's at his lowest point and ask to borrow some pussy y'all act like y'all don't have it smfh. Yo I hate this generation.", "link": "https://www.reddit.com/r/copypasta/comments/fscd2m/its_crazy_how_all_females_want_male_friends/"}, {"title": "Reddit should start their own country", "content": "Reddit should start their own country.\n\nThink about it: it would have a much higher IQ than most other countries. We could ban tik tok and fortnite, and every computer sold has to come with Minecraft preinstalled. We could also ban emojis too.\n\nWe all have very good ideas about society and government, so I think we would be far more efficient. I've seen so many posts with so many good ideas, not to mention our country would be the most progressive and other countries would look to us for direction. We would easily become the next superpower. If everyone left America for a new country, we would easily surpass America.\n\nWe could make Keanu our president and have PewDiePie on the flag. It would be the most wholesome country too!\n\nThose are just some ideas I have and my own opinion.", "link": "https://www.reddit.com/r/copypasta/comments/fsm8z1/reddit_should_start_their_own_country/"}, {"title": "I fucking love my penis. I love my penis. Penis penis penis. Cock. Monkey cock. Dumb on cock. Hard cock. Soft cock. It’s all cock. Cock in my hand.", "content": "Yo, bros. Let me make a confession, alright? It might take me a while because I have to keep pausing this manifesto to stroke. But here it is: I am *fully* addicted to stroking my dick. I squirt my nut at least 3 times a day, but I’m working on getting better at edging. I can’t help it. At work, I’m more or less a normal guy. Except I’m thinking about how long I’m going to masturbate when I get home. I work retail, so it’s a lot of walking and squatting. All day I feel my underwear on my body. My jeans. Whether it’s my silky boxers or my old cotton briefs. All day I just feel my dick rolling around down there, fabric pressing up against my taint and my asshole. Rubbing on my ass. When I take a piss break, my meat rolls out of my drawers and I smell my bate from the night before. The whole bathroom just gets permeated with that salty cock smell. The old cum. Drops of piss. God it gets me horny. I look down and admire my cock as the piss rushes out.  Then I finally get home. I rush to the bathroom and strip down and get the shower running. Half the time I don’t even really shower, I just sort of absentmindedly pull my pud until I figure I’ve stood under the water long enough. After I get out, I eat a quick meal while I paw at my bulge through my shorts. And then the real fun begins. I get totally naked. Or just pull my shorts down around my ankles. Pull up some videos of other dudes masturbating. Run my fingers through my pits, my pubes, all over my taint. Then I bring them up to my nose. The scent of my own skunky pits and musky taint is intoxicating. I look at my penis. I tell my penis I love it. I watch other dudes fall in love with their dicks. He becomes his penis. I become mine. I become him and he becomes me. That’s the nature of the brotherhood, dudes. When I put my hand on my penis, I can feel your hand on your penis. And my asshole clenches and releases again and again. And my balls bounce around. My taint gets tight. And my whole body becomes pleasure I fucking love my penis. I love my penis. Penis penis penis. Cock. Monkey cock. Dumb on cock. Hard cock. Soft cock. It’s all cock. Cock in my hand.", "link": "https://www.reddit.com/r/copypasta/comments/fstr7a/i_fucking_love_my_penis_i_love_my_penis_penis/"}, {"title": "Brought to us by u/Delicious-Hot-Dog", "content": "I'd love nothing more than to have a team of scientists, dressed in full PPE, slowly pull out a never ending chain of colorful handkerchiefs from my ass while I'm on my knees in full clown regalia, with my face adorned with the honkiest red nose ever conceived. For hours, days, months, years, decades, this team of stunned scientists would pull more and more and more handkerchiefs, each covered in just a bit of uncomfortable mucus or slime of which the test results cannot confirm or deny whether it is human in origin. Like a cuckoo clock, every half hour, I would gyuck-a-hyuck giggle and laugh while honking my clown nose at an inhuman rate. What sanity hath thee left, scientists, after pulling my handkerchiefs for so long? As the generations pass, I would be kept, preserved as some grotesque abomination, a thing that must be hidden, but never destroyed. Yet still, brave men and women who dare to read the redacted files and notes of yore scrawled, in desperation, by those driven mad, yes, these foolhardy scientists will take to my chambers and pull those handkerchiefs once more. They will find no end to it. They will find no happiness, no satisfaction. They will find only the dull horror of the infinite.", "link": "https://www.reddit.com/r/copypasta/comments/fsp5lu/brought_to_us_by_udelicioushotdog/"}, {"title": "Yes! I am a SPOILED WIFE—", "content": "⭐️⭐️⭐️ Yes! I am a ⭐️⭐️⭐️    \nSPOILED WIFE    \nBut not yours    \n`I am the property of a freaking`    \nAWESOME HUSBAND    \nHe’s a bit crazy and scares me sometimes    \nBUT HE KNOWS MORE THAN HE SAYS    \n✧ﾟ･: * THINKS MORE THAN HE SPEAKS *:･ﾟ✧    \nAND NOTICES MORE THAN YOU REALISE    \n*He loves me so much and*    \n.............    \n`IF YOU MESS WITH ME`    \n# THE BEAST IN HIM WILL AWAKE    \n# &amp;amp; THEY’LL NEVER FIND YOUR BODY    \n(Yes, he cooked me this copypasta)", "link": "https://www.reddit.com/r/copypasta/comments/fsizwm/yes_i_am_a_spoiled_wife/"}, {"title": "This was a funny comment! Are you a comedian?", "content": "This was a funny comment! Are you a comedian? Because there are not enough words in the English language to express how fucking hilarious this comment was! I am in absolute agony from laughing at this comment for so long. The only way to stop this this this agony is to end my own life. Thanks, this comment made me want to fucking kill my self.", "link": "https://www.reddit.com/r/copypasta/comments/fst2gb/this_was_a_funny_comment_are_you_a_comedian/"}, {"title": "How the Coronavirus started", "content": "There was an old lady who swallowed a bat. I don’t know why she swallowed a bat, imagine that. There was an old lady who swallowed an owl. My, oh, my, she started to howl. She swallowed an owl to hush the bat. I don’t know why she swallowed a bat, imagine that. There was an old lady who swallowed a cat. Why do you think? Now she’s so fat. She swallowed the cat to chase the owl. She swallowed the owl to hush the bat. I don’t know why she swallowed a bat, imagine that There was an old lady who swallowed a ghost. What do you think? She liked it the most! She swallowed the ghost to catch the cat. She swallowed a cat to chase the owl. She swallowed the owl to shush the bat. I don’t know why she swallowed the bat, imagine that. There was an old lady who swallowed a goblin. It made her dizzy, so she started to spin. She swallowed the goblin To scare the ghost. She swallowed the ghost to catch the cat. She swallowed the cat to chase the owl. She swallowed the owl to shush the bat. I don’t know why she swallowed a bat, imagine that. There was an old lady who swallowed some bones. There were so many, she started to groan. She swallowed the bones to rattle the goblin. She swallowed the goblin to scare the ghost. She swallowed the ghost to catch the cat. She swallowed the cat to shush the owl. She swallowed the owl to shush the bat. I don’t know why she swallowed the bat, imagine that. There was an old lady who swallowed a wizard To cast a spell so she could yell, “TRICK OR TREAT!” Burp", "link": "https://www.reddit.com/r/copypasta/comments/fsufzm/how_the_coronavirus_started/"}, {"title": "CUMMING💦 over for that vaccine💉", "content": "ACHOO! Sorry, did I spray you? 💦😉 🧻Corona🤧 is CUMMING💦 for us and you’ve just tested 😱positive🦠 for being 💋NAUGHTY😉 🙅‍♀️Social distancing is in effect🚫 and I want to spend my 🤷‍♂️quarenTEEN🔞 with YOU 😍 So grab your 🧴isopropyl-lubricant 💦 and CUM👅 over so I can administer👩‍⚕️ your treatment😉 and inject💉 you with the vaccine🍆 We’ll spend the 🗝lockdown🔒 flattening the curve📉 and FATTENING DEM’ 👏🏿 CURVES 🍑 Get ready for 14 days of 💯THICC DICC DIAGNOSTICS😭 and sitting on my facemask😷 Send this ✉️ to covid-19 of your sloppiest 💦💦SYMPTOMATIC🤒 SLUTS🤫 If you get 5 back, you’re a Wuhan bat🦇 bitch 👎 If you get 10 back, you’re a 😉horny💄healthy💪hoe😘 If you get all 19 back👏 your ass🍑 is the ANTIDOTE💊 and it’s in high demand 👬🏿", "link": "https://www.reddit.com/r/copypasta/comments/fsr0h7/cumming_over_for_that_vaccine/"}, {"title": "Do you think I WON'T fight dirty you gay piece of shit?", "content": "This is a PSA to NOT FUCK WITH ME. I'm not made out of arms and legs. I'm made out of elbows knees and teeth. Honour is gay.\n\nIf I start a fight with you you've already lost as you literally won't know what hit you. I've won lots of fights by not telling the other person we're fighting. If you start a fight with me my first instinct will be to crouch scream and beg for forgiveness. Then while you're confused I'll shoot up from the floor and shove my thumbs into your eyes you SLUT. I'll tell you that if you don't stop trying to fight back i'll blind you. Then when you start to relax I'll knee you in the balls throw you to the floor pull your trousers down and yank your balls so hard they detach from your body. Now I'll take my little Dennis the menace out and start pissing on your face.\n\nPeople say you can't kick a man while he's down. That is wrong, in fact it's one of the best times to kick someone. I'll kick you in the balls, the nose, the ribs(until they feel soft), the ears. I'll also stomp on your fingers, ankles, wrists, teeth, balls .\n\nAt this point I'm hard and if I'm honest I've probably already spunked on you (hands free) in the excitement. Also my plans gone out the window and I'm adlibing some kind of finger fucking session where your various face holes are/used to be. Yes Daddy please DAddy DaDdy shve  it my wet bloody holes!!\n\nSo yeah does anyone know about a Brad Pitt fight club type place only its gay and you can have sex? What was I saying.....something to do with self defence?", "link": "https://www.reddit.com/r/copypasta/comments/fsnrc0/do_you_think_i_wont_fight_dirty_you_gay_piece_of/"}, {"title": "Tom Nook is Not Fascist", "content": "I cannot let this slander slide. Tom Nook gives you a place to stay, a part time temporary job, and a loan with 0% interest and 0 late fees. You can pay that whenEVER you want. \n\nYou keep wanting to expand your house? He asks if you are sure you want this and offers you, again, 0% interest and a payment plan that is so lax, he barely even mentions it. If you keep finding yourself in debt to him don’t blame him, blame your ego, your choices, and your hubris to have a bigger house and more rooms. You want nice things? Nice things cost money. And that’s that on that. Side note, he even sells affordable medication. \n\nTom Nook 2020.", "link": "https://www.reddit.com/r/copypasta/comments/fsqjej/tom_nook_is_not_fascist/"}, {"title": "A rant by the Coronavirus challenge girl", "content": "OMG You boomers are so mad. Coronavirus only kills old people so thats why your mad and blame us. Its not my faulty that I was drinking and snorting cocaine on a beach all day, than paying a bat to fuck me. Why are you so mad, OMG, I cant even go to prom anymore, no one can even see my plastic filled lips. I don't even want to take the ketamine anymore yoda had the best sex OMG shut down yoda fucks me the best. Coronavirus only happened because a girl started smoking bat cocaine in China for Youtube views. There's a difference. I take a sniff of that deep plastic surgery enhancing shit and lick toilets per my boyfriend's dick, who addresses me as cumdumpster. OMG SHUT UP THERE'S A DIFFERENCE BETWEEN ME SIPPING THAT GOOD TOILET WATER. TOILET WATER IS SO REFRESHING AND YOUNG PEOPLE CANT GET CHINESE VIRUS SO WHO CARES.", "link": "https://www.reddit.com/r/copypasta/comments/fss2d9/a_rant_by_the_coronavirus_challenge_girl/"}, {"title": "Minimum Requirements", "content": "If your frame rate drops from 420000 to 419999, then you'll have to upgrade your computer. I recommended the NVIDIA AMD SUPREME GTXXX 1337 512GB RAM and the ISS 60 Core Processor to achieve maximum frames while playing Minecraft Story Mode. Clearly a GTXXX 1337 is nowhere near the standards of a professional self-proclaimed computer science PHD like myself, but it should be an affordable option for you bottom 75% low-income wretches. I personally use a QUANTUM AMDXNASA ZTX 50X2500T- BLACK-HOLE-GENERATING-9001X 1024TB DDR12 (32768X) HOMUNCULUS GTXTXTXTXTXTXT5100TI and the IBM NUCLEAR-POWERED 500 CORE 120000 HORSEPOWER INTERGALACTICALLY-ACQUIRED PROCESSOR. As well as a 90K 11520x16000 resolution monitor with 8000000000000000hz refresh rate. Not to mention, 950000000000TB of storage, 750 Trillion-Gigawatts of power supply, and a motherboard forged through an ancient Mongolian technique originating from 7th century B.C, passed on to strictly one generation of blacksmith at a time. The process begins by scourging the Eurasian Steppes for a specific type of silicon ore. The name of this material is too complex to be translated to English, and I fear that if I told you the name, it would be lethally ravaging to your feeble virgin mind. But for the sake of reference, we will roughly translate this material to “Khamag Yurmumgei.” Once Yurmumgei is acquired, the material must be transported to the blacksmith and forged within 32 hours, otherwise the material will begin leaking corruption which will ultimately result in the demise of the multiverse. After delivering the Yurmumgei, he who had delivered it must immediately commit suicide. Otherwise the ore will begin to gain malevolent sentience and start attacking everyone in the vicinity. It is said that by commiting suicide, the spirit leaves the corpse and is then consumed by the Yurmumgei ore, leaving it content and willing to be smelted. Once smelted, it can freely be forged as one pleases. For my motherboard, a Chinese sweatshop laborer volunteered to mine Yurmumgei ore for the sweet release of death. That’s right, someone died for my motherboard. He probably had more worth than you. That’s how expensive it is. To add more insult to your injury, I’ve had my motherboard reinforced with black widow spider silk, soaked in 6 billion dollar Silician Malvasia Wine, and coated with Swiss thermal paste consisting of gooseberries and quail saliva. My peripherals include a 48-karat gold DVORAK keyboard and a 99999 carat-diamond mouse. My PC case was hand painted by Leonardo DaVinci himself. I’ve arranged to have an African shaman to cast a necromancy spell on him after hiring some Genovese grave robbers to dig up his corpse. But perhaps the most desirable of them all, a heated silicone 3D wrist-rest Anime Mousepad of Venom Snake in a crouching position, custom made by Hideo Kojima himself.", "link": "https://www.reddit.com/r/copypasta/comments/fsn5sm/minimum_requirements/"}, {"title": "Hi guys, found some funny reddit copypasta which you definitely shouldn’t email to your district representatives and city officials and is only for the funneh memez xD", "content": "Hi guys, found some funny reddit copypasta which you definitely shouldn’t email to your district representatives and city officials and is only for the funneh memez xD:\n\n“April 1st marks the day of International Rent Strike. You will not stand in the way of a movement that aims to liberate the populace, so all can live warmly with roofs over their heads. You will ensure that our precious tax dollars don’t evict another soul on this soil. You will ensure that the right for safe and secure survival trumps the right for extortion and eviction. You can be sure that we will fight until that is ensured. No landlord will see a dollar in rent income up until and thereafter all have safe and secure dwellings. \n\nThere is no compromise. We have more homes than people, and we have more living units in homes than houses. There is no compromise. The greed of a few do not outweigh the rights of the many. There is no compromise. A leader is for the people, and you who protect rent-seeker profits over the populace, betrayed the people!\n\n‘What about him and what about her and what about them’ they will say, as they refer to the fortunate who will lose few over the misfortunate who stand to lose it all. All can have roofs over their heads. Just not at one’s cost and the other’s parasitic benefit. Eviction need not happen. \n\n‘But who will build the homes and who will buy them?’ the builders will build for the roof-seekers that seek bigger roofs. We have more homes than people, and more living units in homes than houses. \n\n‘But truly, the rental property owners do good work!’ When they plumb they do good work. When they paint they do good work. When they carpent and configure wires they do good work. But where is the good work in ownership? Surely there is a large workforce of the good work, and an unnecessary own-force of the lack thereof. \n\n‘You are lazy, expecting to not work and get things for free. You are nothing but an entitled grout!’, yet they do not respond this way when one needs food or water. Yet when one wishes to not be devoured by pests in the summer days, awash with heavy rain in the spring-days, buried in black-frost upon the winter days, and a detrimental mixture of all upon the unlucky fall-days, why do they receive such vitriol? When rent-seekers fill their own pockets to the detriment of roof-seekers, and demand the working taxpayer to protect this right, why do they receive such praise and promise? \n\n‘You wish to seize this property through violent force, it is YOU who are in the wrong’ and to that we say ‘you wish to remove a roof-seeker from shelter through violent force for your own pockets with my hard-earned labour-fruits. I self-preserve as much as you do. Right and wrong absent of humanity is sociopathic conjecture. To such conjectures, it is right and necessary to be wrong!’\n\nTo the important person this is sent to, you understand what is at stake here. It took an earthly rumbling to make cracks of golden light on the black concrete. The people will strike, and you who are for the people, will ensure their demands are seen. A world where all men are created equal. A world where all have maximized life, liberty, and paths to happiness. You took on the role of public servant for none other than this goal. We the people fought for none other than this goal. The first step, on April 1st and beyond, is to ensure not another soul on this soil gets evicted. Hereafter and Beyond!”", "link": "https://www.reddit.com/r/copypasta/comments/fsqgog/hi_guys_found_some_funny_reddit_copypasta_which/"}, {"title": "Me and my mom just had this long ass discussion over whether it would be more confusing to wake up in a bathtub of lotion or a bathtub of lukewarm mayonnaise.", "content": "Me and my mom just had this long ass discussion over whether it would be more confusing to wake up in a bathtub of lotion or a bathtub of lukewarm mayonnaise. I personally think the tub of lotion is more confusing since lotion is meant to be soothing, plus it usually smells good. Mayonnaise is the perfect torture device in large quantities because of the smell and sliminess of it, so if your kidnapper *really* wanted to torture you in the least evil way possible, they’d use the mayonnaise. Lotion is just-... soothing. Now, what adds the real kick is the setting. If you were to wake up in your own home in a tub of lotion or mayo, would it be more or less confusing than waking up in, well, a different home with the tub? Waking up in your own home would imply that someone broke in simply to fuck with you, while the other would be considered a legitimate kidnapping. Waking up in your own bathtub full of lotion is more confusing than waking up in a strangers bathtub full of mayo. Case closed. The lotion is confusing and weird, while the mayo is straight up torture.", "link": "https://www.reddit.com/r/copypasta/comments/fstyfv/me_and_my_mom_just_had_this_long_ass_discussion/"}, {"title": "Trump bible verse (credit to u/GloryToDucks39)", "content": "\"And that Jesus guy started walking on the water. I always thought he could walk on the water. Always have. His walking on the water. Unbeatable. I was standing right there and looking at him as he was walking on the water. We were friends. We always cared for each other and supported each other. We always were good friends. My haters think that I hate Jewish people. Lies. We were always good friends.\"", "link": "https://www.reddit.com/r/copypasta/comments/fstxir/trump_bible_verse_credit_to_uglorytoducks39/"}, {"title": "Oh, Nice cock.", "content": " Okay let's see what we're working with. (\\*thump\\*) Woah.. Nice cock. Thick, but not too flaccid. Perfect length. A nice 80 degree angle. Eeh, could trim the hairs a bit but we'll work on it. Yep, I'd say that's a pretty good cock. I rate it... 8.5 out of ten. Good job kiddo.", "link": "https://www.reddit.com/r/copypasta/comments/fsc6fq/oh_nice_cock/"}, {"title": "Do you use emojis", "content": "I'm a professional editor. I don't use emoji because I can leverage the power of the English language. Little colored blobs do not enhance the strength of my prose.", "link": "https://www.reddit.com/r/copypasta/comments/fsuqkg/do_you_use_emojis/"}, {"title": "I have an inflation fetish", "content": " I have an inflation fetish, but its not a fetish about inflating myself, but a fetish about economic inflation. Every day I turn on BBC and masturbate to the news about the british pound losing its value. I vividly remember being rock hard during history class when we were talking about the great depression. To this day I'm thankful for the year 2008, when I busted the bighest nuts every day to the news of real estates losing value", "link": "https://www.reddit.com/r/copypasta/comments/fsdjpv/i_have_an_inflation_fetish/"}, {"title": "SIMP ALERT 🚨", "content": "‼️‼️HOLY FUCKING SHIT‼️‼️‼️‼️BOIS I SEE A MOTHER FUCKING SIMP!!!!!1!1!1!!1!!1!!1 😂😂😂😂😂🤣😂🤣😂😂THIS MOTHER FUCKING SIMP XD LMAO ⬆️⬆️⬆️🏅🏅🔥🔥🔥🔥🔥🔥💯💯💯💯💯💯💯💯DID YOU KNOW THAT REDDIT HATES SIMPSSSSS?👨👨👨👨👊👊👊👊👊👊👊😎😎😎😎😎😎😎😎😎 S I M P S I M P S I M P S I M P S I M P S I M P S I M P S I M P S I M P S I M P S I M P S I M P S I M P S I M P S I M P S I M P S I M P S I M P S I M P S I M P S I M P S I M P S I M P S I M P S I M P S I M P 😆😆👨👨👨👨👨👨👨👨👨🤓🤓🤓🤓🤓🤓🤓 REDDIT DISLIKES SIMPS DID YOU KNOW THAT???!?!?!!?!??!? NO SMIPS HERE🥶NO SMIPS HERE🥶NO SMIPS HERE🥶NO SMIPS HERE🥶NO SMIPS HERE🥶NO SMIPS HERE🥶NO SMIPS HERE🥶NO SMIPS HERE🥶NO SMIPS HERE🥶NO SMIPS HERE🥶NO SMIPS HERE🥶NO SMIPS HERE🥶", "link": "https://www.reddit.com/r/copypasta/comments/fsqgsw/simp_alert/"}, {"title": "how to pick up egirls on discord apparently", "content": "Mm\\~ how about I fuck your fucking mouth then I cum in it and take out my cock, place it firmly inside as I chock you from behind squeezing your tits as you repeatedly tell me \"fuck me silly\" take out my cock from your ass and stick it right back into your mouth with cum mixed all over it, make you deep throat and gag on it as I spread your legs and eat your your nice juicy pussy\\~ I'll grip your ass nice and tight as I'm repeatedly licking your G-Spot till you cum in my mouth then I keep that cum and bring it to your mouth as we swap tongues making out as I dick you down\\~ sweat\\_drops", "link": "https://www.reddit.com/r/copypasta/comments/fsswux/how_to_pick_up_egirls_on_discord_apparently/"}, {"title": "Cum", "content": "CumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCumCum", "link": "https://www.reddit.com/r/copypasta/comments/fssw43/cum/"}, {"title": "OOP is trash, a programming language copy pasta", "content": "OOP is trash, do you know why?\nBecause you have to make everything you do into a class, and then you have to make that class sentient, give it a life, a family and a job but I don't got fucking time to philosophies my fucking code", "link": "https://www.reddit.com/r/copypasta/comments/fsca46/oop_is_trash_a_programming_language_copy_pasta/"}, {"title": "The Main Characters in Spongebob are Marxist Symbols", "content": "We start with Mr. Krabs, who is obviously the Bourgeois business owner who ruthlessly exploits Squidward and Spongebob. There is no question about this, it is repeatedly demonstrated that Mr. Krabs is a cruel boss, pathetically obsessed with money even at the expense of his own health (“Squid's Day Off”). He has attempted to charge his workers for breathing (“Squid on Strike”), forced them to work 24 hours a day, 7 days a week (“Graveyard Shift”) and even traded Spongebob's soul for a measly 62 cents (“Born Again Krabs”). His continual protection of the Krabby Patty Secret Formula from Plankton, in which he enlists the involuntary help of Spongebob (who sees it as a valiant quest to protect the honor of the Krusty Krab) and Squidward (who is just in it for the paycheck), is nothing more than a cheap quest to protect the profit margin of the Krabby Patty, which he likely sells for more than it is worth. There are two ways his workers can react to this awful situation, and Spongebob and Squidward each represent one of them. Squidward is the class-conscious worker. He is fully aware of his miserable situation under the thumb of Mr. Krabs, thus resulting in his depressed and irritable attitude. He is clearly no stranger to Marxist ideas, being the only one of the two to quit due to Krabs' abuse (“Can You Spare a Dime?”) and starting a strike against Mr. Krabs (“Squid on Strike”). He finds solace in art, and dreams of living in a utopian Fully Automated Luxury Communism, relaxing while making his art and sharing it with the world. It was Oscar Wilde, after all, who argued in The Soul of Man Under Socialism that only when their needs are fully accounted for can the artist truly hone their creative genius. He is continually disappointed with his fellow proletarians, the denizens of Bikini Bottom, most of all Spongebob.\n\nIf one thinks about it, Squidward really has no apparent reason to hate Spongebob. Spongebob is incredibly kind to Squidward, giving him gifts, saying good morning to him every day, altogether just trying to bring joy into Squidward's life. We are led to believe that Squidward is simply a curmudgeon who hates Spongebob for being happy while he is depressed. But is that really as deep as it goes? I think not. Once one realizes the Marxist undertones in Spongebob, the answer is clear: Squidward resents Spongebob because he is not class-conscious.\n\nDespite his miserable working conditions, despite his boss's abusive behavior, Spongebob remains relentlessly optimistic. A classic case of the unconscious worker. He is cheerful and optimistic about his condition because he is unaware of anything beyond it. He has a Stockholm Syndrome-esque relationship with his boss, seeing him as a father figure (a classic symptom of blind obedience to authority) and enduring humiliating treatment because he holds on to the promise of one day owning the Krusty Krab, thus taking Krabs' place as the new Bourgeois. Given that he does not even know what a Strike is (“Squid on Strike”) it is clear that he has never been exposed to the Marxist critique. In this context, Squidward represents the ill fate of the worker who does not respect his fellow worker. His attempt at revolution fails because he does not respect Spongebob, and simply tried to use him as a pawn for his own ends. But I digress.\n\nPatrick represents what Marx called the Lumpenproletariat. Unemployed, he is left out of the class struggle, and even if he were involved in it would be too stupid to do anything, as symbolized in his attempt at employment in “Big Pink Loser”. However his value to Squidward, the class-conscious worker who hopes for revolution, is underrated. Marxists from Bakunin onward have criticized Marx's rejection of the lumpenproletariat, and Stephen Hillenburg is no exception. Patrick clearly has the socialist spirit in him, recognizing the value of idleness and enjoying life's simple pleasures. Patrick never seeks after money or power as the Bourgeois expects him to, he simply wants to live out his life in peace. He values friendship over all things; he once admitted to spending all day waiting for his best friend, Spongebob, to come back (“New Student Starfish”). Could this represent how industrial work gets in the way of social bonds? Possibly. The point, my friend, is that Patrick in his idle lumpen state has captured the same optimism and joie de vivre of Spongebob. It could be said that the only difference between him and Spongebob is that Spongebob has subsumed to industrial work. In this way, he is the proletarian who is conscious of Socialist ideas without even knowing it.\n\nSandy and Plankton represent two possibilities of the future in Marxist analysis. Both of them are clearly college-educated scientists whose approach to technology differs based on their position towards Capitalism. Plankton represents the dystopian Capitalist future, the future of Cyberspace where companies like the Chum Bucket control society (remember that Plankton's expressed goal is to “take over the world”). He represents a cold, distant, inhuman, industrial future, as symbolized by the cold metal interior of the Chum Bucket.\n\nSandy, on the other hand, seems as well-versed in technology as Plankton, but has used it for a completely different purpose. She has created the treedome, an ecological, self-sustaining utopia in which she has everything she needs. She built a rocket to the moon for the sole purpose of exploration (“Sandy's Rocket”). She pursues science out of pure wonder and a desire for the fulfillment of knowledge, unlike Plankton who pursues science out of a desire for domination and control. She represents Fully Automated Luxury Communism, a utopia in which everyone has everything they need and are free to pursue their passions without the burden of work.\n\nFinally, we have Mrs. Puff. Mrs. Puff was a hard one, but I think she represents the failure and uselessness of modern education. She continually attempts to teach Spongebob a useless skill (he walks to work, he doesn't need to drive) for a pathetic trinket of authority (his driver's license, whose possibility of attainment he worships).", "link": "https://www.reddit.com/r/copypasta/comments/fsggc0/the_main_characters_in_spongebob_are_marxist/"}, {"title": "You chose INTEL OVER AMD?!?", "content": "YOU SERIOUSLY CHOSE INTEL OVER AMD?\n\nYou idiot. You bumbling buffoon. You bipedal octopus.\n\nHAVE YOU NEVER HEARD OF CORE COUNT?? Ryzen has EIGHT were Intel has SIX. \n\nNEVER HEARD OF CLOCK SPEED? NEVER HEARD OF LOGICAL PROCESSORS? AMD HAS SO MUCH MORE.\n\nTHE TESTS MAY SHOW THAT THE INTEL CPU IS FASTER, BUT AMD IS THE BETTER BRAND, TRUST ME.\n\nLISA SU IS AMAZING AND BEAUTIFUL AND GLORIOUS AND WONDERFUL AND THE MOST INTELLIGENT PERSON ALIVE. I WOULD LOVE TO SUCK HER TOES AT ANY GIVEN OPPORTUNITY.\n\nThis is why AMD is better you based Intel cuckold.", "link": "https://www.reddit.com/r/copypasta/comments/fsjr8v/you_chose_intel_over_amd/"}, {"title": "Hentai be like", "content": "B-be my dicky daddy! Gimme a s-sippy of your yummy cummies!^-ies! ^-ies! ^-ies!\n\nAh! Um! I need 20 CC’s of cummies STAT! I’m going into cummiac arrest! Please inject your yummy cum medicine into my happy little good girl hole!\n\nDaddy, be nimble, daddy, be quick, daddy, give me all 8 inches of your dick!\n\n1 cummy,\n\n2 cummy,\n\n3 cummy,\n\n4!\n\nI’m daddy’s princess, but I’m also a whore!", "link": "https://www.reddit.com/r/copypasta/comments/fsffrj/hentai_be_like/"}, {"title": "You absolute fuckwad.", "content": "You absolute fuckwad, I will put your retarded little head in between the seat and bowl of my toilet and take the longest liquid shit you have ever seen, your head will be positioned in such a way under my crippling weight that every last drop of shit will slowly roll down your head, staining your scalp with the shit and blood coming out of my loose asshole, dont think for a second that you have any power over me.", "link": "https://www.reddit.com/r/copypasta/comments/fsrtut/you_absolute_fuckwad/"}, {"title": "☣You 🦇 have 🦇 been 🦇 blessed 🦇 by 🦇 the🦇 COVID-19 🦇 emoji 🦇 Prepare 🦇 for 🦇 a 🦇thousand 🦇 years 🦇 of 🦇 sneezing 🦇 and 🦇 coughing 🦇 and 🦇 an 🦇 infinite 🦇 absence 🦇 of 🦇 toilet 🦇 paper🧻🚫☣", "content": "Edit: Wow. Jesus Christ I've been waiting for this day.🍾 Hours I have spent 🍑karma whoring🍑myself out to Reddit and today I made it. I. fucking. made. It.🤯 I showed this to my mom🤰, she hugged me and told me how proud of me she was, teary-eyed.😢 My only regret is not having this happen sooner so I could put it on my college application. 😤\n\n😎\"Got 5k upvotes on a Reddit post on r/copypasta\"😎 it would say.\n\nGod do you know how many doors that would opened of for me?👩‍🎓 Forget Model UN🚫 and National Honors Society.🚫 I could've deleted all that shit if I had this on my application.💯\n\nThis is the biggest achievement I think I've ever had.🥳\nGod dammit I'm sobbing right now. 🤧😭\n\nThat online degree in EMOJI LINGUISTICS 101 really helped me out, too. 😌 $500 bucks well spent 🤑", "link": "https://www.reddit.com/r/copypasta/comments/fru28e/you_have_been_blessed_by_the_covid19_emoji/"}, {"title": "Can I simp for you?", "content": "Hey, on behalf of all of the men out there, I would like to formally apologize for all of the disrespect they show you and for all of the times you have been treated like a piece of property. I personally think that all women deserve to be treated like queens and that it should be to goal of every man to serve all women, no matter how what, because men have been misogynistic and cruel for far too long. It just enrages me so much to see a “dude” call you out on Twitter and pretend that you don’t have thoughts and feelings that can be hurt. I wish that I could find him and beat him up so I can show him how much it hurts to be a woman these days. I would do anything to make sure that you never had to experience harassment from a male because he thought it was acceptable to treat women like property. Women aren’t property. Women are amazing. Women are the foundation of our world and need to be celebrated for all of their accomplishments. First, I would like to start by celebrating you for being the queen you are.", "link": "https://www.reddit.com/r/copypasta/comments/fsrrn0/can_i_simp_for_you/"}, {"title": "I figured out how to whistle with my penis,", "content": "I figured out how to whistle with my penis. You know how when you try to pee but there's no pee nothing happens right? Well if you do it hard enough your penis will suck air back in when you release the pressure, so that the next time you put pressure like on ur bladder to \"pee\" it'll start whistling. As a matter of fact with a few hours practice I managed to squeeze out hot cross buns.", "link": "https://www.reddit.com/r/copypasta/comments/fsmwyt/i_figured_out_how_to_whistle_with_my_penis/"}, {"title": "So, retard, I guess you're just gonna right based huh?", "content": "So, retard, I guess you're just gonna right based huh?\n\nWell, fucker, you must know that if you have written a retarded comment then you have come into *my* domain, and are in great danger.\n\nAlright, cuntman, I have downvoted your comment because I think the massive amount of uninteresting and bland bitches such as yourself write the le epic funny based word too many times.\n\nReally, nipple resembler, the childishness in this word is so apparent that I'm surprised that you aren't sexually attracting lib-rights to yourself right now.\n\nTherefore, bitchboy, you've been downvoted, and this means 2(two) things.\n\n1. Your karma has been reduced by 1(one)\n2. This comment is now slightly(a little bit) less likely to be seen.\n\nNow, thick-eyelids, you may be asking yourself, \"How do I get downvoted less?\" and don't worry kid, there's a simple answer.\n\nAll in all, un-Keanu, just stop being a little fucking baby and actually comment useful/interesting things to say.", "link": "https://www.reddit.com/r/copypasta/comments/fsnp48/so_retard_i_guess_youre_just_gonna_right_based_huh/"}, {"title": "You mcm", "content": "ur mcm wakes up , it is 3 o clock pm. he rolls over on his twin sized mattress which is on the floor n grabs his weed pipe he got at the indian store. he proceeds to try n hit a bowl w absolutely nothing innit except hopes n dreams. after inhaling some hot air he proceeds to cough for exactly 16 seconds straight. finally collecting himself he sits up and winces in pain as the dried semen from last nights onlyfans session cracks and pulls the small hairs on his tummy. he grabs his samsung milky way x2 from 2013 off his cigarette ash stained nightstand n opens fb. \"quarantine or not the grind dont stop , ima chase a bag till they put me in the dirt omm 💯💯\" he posts , completely satisfied w his first fb flex of the day. he goes n peeks in his moms room , thrilled that she is in fact still at work. he walks over to her dresser and rummages thru it collecting $10 in loose change , an ativan , and 3 pall mall ultra light menthol 100's. he lights one immediately. \"todays gonna be a good day\" he thinks to himself. it was in fact not a good day. he walked a mile away to the nearest convenient store to meet up w his weed man and while sitting outside on the curb a homeless man came up and asked him for a cigarette. he was feeling generous due to his earlier collection of the $10 in change so he reached in his pocket and pulled out the cigarette case which contained the aforementioned pall malls and the $10 bill he had exchanged his change for. upon seeing the $10 bill tucked into the plastic on the cigarette box the homeless man proceeded to snatch the entire pack out of ur mcm's hands and take off in a full , u-could-never-ever-catch-him crackhead sprint. ur mcm started to chase him but after seeing the absolute fukn acceleration that man had produced he stopped in his tracks , defeated. moments later the weed man pulled up only to see ur mcm holding back tears. ur mcm walked up to his driver side window w tears in his eyes and proceeded to tell him what had just happened in hopes he might get a sympathy gram. he did not. the weed man laughed in his face , slapped him for wasting his time , then called him a bitch and told him not to ever contact him again. an attractive young woman , having seen these events transpire from inside the store , walked out and laughed in ur mcm's face while walking to her nissan altima. ur mcm walked back home w his head down and once within range of his home wifi he opens fb again. \"real bosses take a L and bounce back 🚫🎩 #BusinessMind #Entrepeneur\" he types. he takes a deep breath and clicks post before putting his phone back into his pocket. the microwave dings as he takes his offbrand ham n cheese hot pocket out. it is still frozen in the middle.", "link": "https://www.reddit.com/r/copypasta/comments/fsq79r/you_mcm/"}, {"title": "My take on a r/Freefolk rant", "content": "In the books, the beginning of the first scene takes place with the Night's Watch members already north of the Wall. But the show has the AUDACITY to begin with them at the Wall, going north?! This show clearly has absolutely ZERO respect for the source material if they're going to make such a massive deviation from the source material so soon in the series. I am more disgusted than I've ever been in my life. I've already destroyed the season 1 dvds and sent hitmen after the former showrunners. Every time I think about what could've been had they started the show with the Night's Watchmen already north of the Wall, I go into a blinding rage and destroy everything in sight. Even The Last Airbender movie was better than this pathetic excuse for a tv show.", "link": "https://www.reddit.com/r/copypasta/comments/fsoxrj/my_take_on_a_rfreefolk_rant/"}, {"title": "Facebook status I found this morning", "content": "TRAFFIC is gone, LONG QUEUES are gone. 🚗🚙\n\nFUEL is affordable, BILLS extended.\n\nKIDS are at home with their FAMILIES, PARENTS are home taking care of their CHILDREN. 👩‍👧‍👧\n\nFAST FOOD replaced by HOME COOKED MEALS, hectic SCHEDULES replaced by NAPS. 🛌\n\nThe AIR seems CLEANER, the WORLD QUIETER. 🤫\n\nPEOPLE are conscious about HYGIENE and HEALTH again. 😷\n\nMONEY doesn't seem to make the WORLD GO ROUND anymore. 💸\n\nAnd WE now have TIME, finally, to STOP and SMELL the ROSES.🌺🌹\n\nFinally We get to see woman's real eyebrows and hair colour\n\nIt seems like this COVID-19 is a RESET BUTTON for HUMANITY!!!\n\n#copypaste 😘💐. #stayhome #staysafe #staypostive", "link": "https://www.reddit.com/r/copypasta/comments/fsvw4e/facebook_status_i_found_this_morning/"}, {"title": "Every 2008 profile", "content": "hi every1 im new!!!!!!! holds up spork my name is katy but u can call me t3h PeNgU1N oF d00m!!!!!!!! lol...as u can see im very random!!!! thats why i came here, 2 meet random ppl like me _... im 13 years old (im mature 4 my age tho!!) i like 2 watch invader zim w/ my girlfreind (im bi if u dont like it deal w/it) its our favorite tv show!!! bcuz its SOOOO random!!!! shes random 2 of course but i want 2 meet more random ppl =) like they say the more the merrier!!!! lol...neways i hope 2 make alot of freinds here so give me lots of commentses!!!! DOOOOOMMMM!!!!!!!!!!!!!!!! &lt;--- me bein random again _^ hehe...toodles!!!!! love and waffles, * ~t3h PeNgU1N oF d00m~*", "link": "https://www.reddit.com/r/copypasta/comments/fsu1v5/every_2008_profile/"}, {"title": "Have a trident!", "content": "♆\n\n |\n\n |\n\nHere, have a trident! :)", "link": "https://www.reddit.com/r/copypasta/comments/fstvuc/have_a_trident/"}, {"title": "They should put periods in the Sims", "content": "I feel like putting periods in the Sims would be a good thing but not everyone would like it, like I wouldn’t mind it because it’s very accurate to real life, I mean it happens to every woman. Then again, it’s a lot of work.", "link": "https://www.reddit.com/r/copypasta/comments/fstt8g/they_should_put_periods_in_the_sims/"}, {"title": "Rubbing a 12 year old.", "content": " I just spent the last twenty minutes rubbing a twelve year old girl's bare chest. \"How?\" you ask. Well apparently there are a select few contexts within which such an action is acceptable. For instance, if your niece has a hacking cough and your sister asks you to \"put some of this on her\" while she calls the doctor. \"Putting some of this on her\" meant using my bare hands to rub this vapor ointment shit all over her BARE NAKED CHEST. My heartbeat is still all erratic from it. I had a boner the size of Manhattan the entire time. She's sleeping now and I guess she feels better because she stopped coughing. Details: She's about 5 feet tall, has long brown hair, a cute face, a thin waist and long skinny legs. She's in jammies I think because although I'm pretty shaken up right now I know I unbuttoned something before I went at it. God I feel so great. I just rubbed my hands all over her FUCKING TITS, you guys. Well the puffy parts of her chest anyway. Her nipples got hard. I just about wept tears of joy. I didn't do anything else because I'm a coward and rubbing was enough. Plus it was legal and I didn't technically do anything wrong, so I'm in the clear. I'd write more but I seriously have to go fap while the memory is fresh in my head.", "link": "https://www.reddit.com/r/copypasta/comments/fss2h8/rubbing_a_12_year_old/"}, {"title": "104 days of corona", "content": "THERE'S 104 DAYS OF SELF\nISOLATION IN\nAND THE CURE COMES ALONG JUST TO END IT\nAND THE ANNUAL PROBLEM FOR OUR GENERATION\nIS FINDING A GOOD WAY TOO SPEND IT (like maybe)\nBUILDING A ROCKET OR FIGHTING A STORE CROWD\nAND THE CLOSING OF THE EIFFEL TOWER\nDISCOVERING A VACCINE THAT DOESN'T EXIST (hey!)\nOR FINALLY TAKING A SHOWER\nCOOKING 5 TIMES A DAY, CREATING CONSPIRACIES\nAND BASICALLY BEING LAZY ALL DAY\nPLAYING DOOM ETERNAL\nORDERING PICK UP FOOD\nBUYING GEAR IN SPLATOON\nAS YOU CAN SEE THERE'S A WHOLE LOT OF STUFF TO DO BEFORE\nTHIS VIRUS KILLS US ALL\n🎵SO STICK AROUND TO SEE IF TRUMP BUILDS THAT WALL🎵\nMOM! PHINEAS AND FERB ARE MAKING A TWITTER THREAD!!!", "link": "https://www.reddit.com/r/copypasta/comments/fsqyk5/104_days_of_corona/"}, {"title": "A favour to dad", "content": "my dad called me today and told me that he had something super important to ask from me... then jokingly proceeded to tell me he needs 100k to get penis enlargement surgery to please my step mom...i can’t with him 😂😂", "link": "https://www.reddit.com/r/copypasta/comments/fsv31d/a_favour_to_dad/"}, {"title": "Badass boomer gets angry", "content": "Do you know who your talking to you dumb cunt? I was a sheriff in texas for 6 years until I got I got shot on the job. Some punkass mexicano boy got funny with me but I still killed him before he could kill me. I dare you try me you dumb motherfucker. Ill put you in the ground just because Im 73 dont mean I cant whup your sorry milenal ass dickhead. I dont give a fuck who your friends are", "link": "https://www.reddit.com/r/copypasta/comments/fstb3c/badass_boomer_gets_angry/"}, {"title": "Oni-chan..", "content": "I was sleeping peacefully in my little bubble, a little forgotten by everyone but that's alright; enough people remembered me. Low hums filled my eardrums, lulling me into slumber. I've done a lot already.\n\nA light tap on my shoulder causes me to awaken. I blink, a little drowsy, and look up. There was my cousin, hovering over me. \"What's wrong?\" I ask. \"I have to leave again.\" He says softly. I tilt my head in confusion. \"Why now? How long with it take?\" He pressed his lips into a thin line. His expression is clouded in the darkness. With sleepy eyes, I gave him my best pout. \"Can't you stay here? I want you to sleep next to me. There's room for you, here.\" I gesture towards the small space next to me.\n\nMy cousin pats my head gently. \"You're so cute,\" he lets out a small laugh and my face widens into a grin. He pulls my head close to his chest. \"But you know I can't,\" he murmurs next to my ear. \"I have a job to do.\" He pulls away quickly. \"Don't go,\" I pleaded. He caresses my cheek with one hand in an attempt to reassure me. It feels rough and tense. With a sad smile, he draws his body away from me.\n\n\"Onii-san!\" I exclaimed, clenching my fists together. Fear ripples through my body. I don't want him to go. He puts a finger to his lips. \"Don't let them know, SARS-chan. From now on, just call me Corona-san.\"", "link": "https://www.reddit.com/r/copypasta/comments/fsqtb0/onichan/"}, {"title": "Liberal racist??!!?!?", "content": "Ok people listen up.\n\n&amp;#x200B;\n\nI think liberals are racist and here's why. Donald Trump is orange and orange man is bad right? And if you say a racist joke about a black person you are a Nazi.\n\n Well, I found this show called orange is the new black. Liberals hate Trump but since orange is the new black that makes Liberals hate black people which is racist.\n\nBoom. Libtards destroyed with facts and knowledge  😎  😎", "link": "https://www.reddit.com/r/copypasta/comments/fspt2u/liberal_racist/"}, {"title": "If you could make anything appear but it has to be from out of your ass, what would it be?", "content": "I'd love nothing more than to have a team of scientists, dressed in full PPE, slowly pull out a never ending chain of colorful handkerchiefs from my ass while I'm on my knees in full clown regalia, with my face adorned with the honkiest red nose ever conceived. For hours, days, months, years, decades, this team of stunned scientists would pull more and more and more handkerchiefs, each covered in just a bit of uncomfortable mucus or slime of which the test results cannot confirm or deny whether it is human in origin. Like a cuckoo clock, every half hour, I would gyuck-a-hyuck giggle and laugh while honking my clown nose at an inhuman rate. What sanity hath thee left, scientists, after pulling my handkerchiefs for so long? As the generations pass, I would be kept, preserved as some grotesque abomination, a thing that must be hidden, but never destroyed. Yet still, brave men and women who dare to read the redacted files and notes of yore scrawled, in desperation, by those driven mad, yes, these foolhardy scientists will take to my chambers and pull those handkerchiefs once more. They will find no end to it. They will find no happiness, no satisfaction. They will find only the dull horror of the infinite.", "link": "https://www.reddit.com/r/copypasta/comments/fsux6m/if_you_could_make_anything_appear_but_it_has_to/"}, {"title": "PLEASE WE NEED A GWEN IN THE FRIEND GROUP 🥵🥵", "content": "Bro, PLEASE I BEG OF YOU!!! I NEED A GWEN FROM TOTAL DRAMA ISLAND TO FUCK ON DISCORD!!!!!  🥵  🥵  🥵  🥵  🥵  🥵  🥵  🥵  As long as you play games and shit it'd be cool   😅   😅  😅  BUT OMG! US BOYS ARE HORNY BRO PLEASE I SWEAR TO GOD I WILL BE YOUR SIMP!  😩  YOU WILL BE PRAISED LIKE THE MECCA CUBE, I WILL WORSHIP YOU JUST AS MUCH AS A MIDDLE AGE MAN WORSHIPS MADDEN FOOTBALL! PLEASE PLEASE PLEASE!!!! Quarantine got us foaming out the mouth  ong  😷  😷 IF YOU DON'T LOOK LIKE GWEN YOU'RE A FUCKING WHORE BITCH!\n\ndiscord : GouperPooper#6256 (PLEASE GWEN BE REAL  😫  😫 )", "link": "https://www.reddit.com/r/copypasta/comments/fst5v1/please_we_need_a_gwen_in_the_friend_group/"}, {"title": "Taken from a post from r/moviescirclejerk", "content": "# Erotic Stuber Neoliberalism fanfiction\n\nVic sits on a bench across the street from Spinsters, shoulders tense, clutching his phone in his fist. Business has been booming, apparently; as Vic watches, a huge crowd of women leave together, all laughing and waving goodbye to each other as if they just did something enjoyable.\n\nVic looks away. These women aren’t who he’s been waiting for.\n\nCompulsively, he unlocks his phone to look at the screenshot again. He doesn’t know why he keeps pulling the image back up again, when he knows all it’s going to do is make his stomach clench with what he assumes must be anger, but he’s never been great at impulse control.\n\nIt’s a simple picture: just a man, arms crossed and smiling, standing in front of a flag. Except it’s not simple at all, because the flag is rainbow, and the man is Stu.\n\nVic had almost choked on his bagel that morning when the ad first popped onto his phone. He wouldn’t have been shocked to learn that Stu was gay (he’d certainly spent enough time lecturing Vic on getting in touch with his emotions), but he wasn’t just gay––he was gay and dating Vic’s daughter. That’s a pretty bold move for someone who had, less than a year prior, witnessed Vic murder numerous people.\n\nFollowing a brief phone call with Nicole (a phone call that had ended with Nicole saying “Dad, it’s not what you––” and Vic hanging up to pay closer attention to the blood pounding in his ears), he had gathered some intel (downloaded Instagram, watched the Spinster account story) and used his keen investigative abilities to ascertain that a board meeting was being held the following afternoon. Which is how he finds himself here, seething on a sidewalk bench, waiting for Stu to leave the building so Vic can kill him.\n\nThe front door swings open again. Vic leans forward, squinting. Bingo.\n\nStu looks healthier these days. Probably healthier than Vic has seen him since the first time they met, back before Stu had ever been hit in the face with a handgun, or held as a hostage, or had been in a car collision with violent criminals. Vic has never done him much good. He pulls his hood over his face and unlocks his phone again. Why start now.\n\nIt’s too fucking easy, Vic thinks as he clicks Request Uber from the fake account he had made that morning . Nothing to it but timing and patience. He watches from across the way as Stu pauses, pulls out his phone, and gets into his car (a new one, obviously; white Corolla, ugly as hell, definitely neither silent nor deadly this time, but Stu must’ve had second thoughts about the wisdom of leasing).\n\nMoments later Stu is pulling his ugly ass car around the corner, stopping where GPS tells him like a good boy. Vic pulls open the door and gets in the back.\n\nThis was the moment he thought might be tricky. Stu is so aggressively hospitable, Vic has assumed there’d be no way he’d be able to get into the car without immediately blowing his cover. But Stu just mutters “Make yourself comfortable,” and pulls away, not even looking at Vic, much less offering him imported chocolate.\n\nThey drive in silence. Vic leans back, staring a hole through the back of Stu’s head and breathing heavily, trying not to be disturbed by Stu’s remarkably sedated demeanor. He’s set his destination to an abandoned lot, shielded by development on all sides. Should be quiet on a Sunday afternoon. Vic almost has to smile at that. God’s day.\n\nAs they approach the destination he can feels Stu starting to get confused, craning forward to look at the desolate lot.\n\n“You sure this is where you want?” Stu asks, breaking the silence at last. “Gotta say, not the most bumping spot in L.A.…”\n\n“I’m sure,” Vic says.\n\nStu visibly freezes. He brakes the car abruptly in the middle of the lot and raises his eyes, slowly, to the rearview mirror.\n\nTheir eyes connect in the reflection. It’s been awhile, Vic realizes, since he last made eye contact with someone.\n\n“No!” Stu squawks. “Vic, no! I will not go on a killing spree again! Do not ask me!”\n\nVic growls low in his throat and reaches around the seat to grab a fistful of Stu’s shirt. “Shut the frick up. You and I need to talk.”\n\n“I have a phone!” Stu is twisting against Vic’s grip. “Call me on my phone! We’ve been over this! Kidnapping people is not nice!”\n\n“You need to explain something to me,” Vic says, pulling Stu forward so he’s forced to twist around and face the backseat. “Explain it real nice and simple, and maybe we’ll get out of here without losing any more teeth.”\n\n“And why the threats,” Stu says weakly. “There are better ways…”\n\nVic grapples clumsily with one hand to retrieve his phone, shoving it at Stu’s face. “This,” he hisses. “Tell me what I’m looking at, Stuber.”\n\nStu blinks at it. “Uh. A neoliberal marketing campaign?”\n\n“Who’s that in the picture? Tell me my eyes aren’t shot to shit, Stu. Tell me I know who this is.”\n\n“That,” says Stu, “would be me.”\n\n“You know, it’s real funny.” Vic barks a flavorless laugh. “Funny ‘cause, see, I thought you were dating my daughter.”\n\nUnderstanding crosses Stu’s face. He groans.\n\n“That’s right.” Vic releases his shirt roughly. “So explain it to me. What exactly am I missing here.”\n\n“It’s really not my place to––” Vic lunges forward again, and Stu throws his hands up by his face. “All right, all right! My god! Calm down for two minutes. We were never really dating.”\n\nThat does make Vic pause. “What?”\n\n“Seriously, dude.” Stu is fixing his shirt nervously, moving with obviously jitteriness. “Have you seen your daughter? You think the only person she can bag is her dad’s kidnapped Uber driver? She’s good. I’m the one you should be worried about.”\n\nIt’s not clicking. “But…” Vic frowns, rubs his forehead with his hands.\n\n“She thought it’d be funny, man. I don’t know. You know I’m a pushover. We were talking about commissioning something from her for the studio, get a little culture in there––she said she’d cut us a deal if I pretended to be her boyfriend. Said you were always so overprotective, that you’d freak out. Gotta say, I wouldn't have agreed if I knew she meant freaking out like this.”\n\n“Jesus.” Vic is shocked for one beat, and then he laughs out loud. “That little scamp.”\n\n“See, I don’t get why you couldn’t have thought that little scamp around the time you were deciding to come knock my teeth in,” Stu tells him. “Serious double standard there.”\n\n“So...what’s the deal with...” Vic brandishes his phone, still not sure what to call it.\n\n“Deal?” Stu shrugs. “No deal. They were looking for volunteers. Showcasing diversity, that was the phrase. I figured there’s no harm in getting my face out there…” He frowns, refocusing on Vic. “But what, you were coming to knock some sense into me? After everything we’ve been through? Seriously, I thought we’d made some kind of breakthrough.”\n\nThis is not going the way Vic had anticipated, and he’s feeling confused. The memory of whatever it was he had planned to do is getting fuzzier and fuzzier.\n\n“Let me guess,” Stu is saying. “You got yourself so worked up, you decided to hurtle after me without thinking anything through. Sorry if this is a sensitive subject, but thank God you lost your job, you do not have the temperament of someone who should be allowed to pull guns on civilians.”\n\n“Oh yeah?” Vic closes his eyes for a moment, processing. “And who does have that temperament, in your opinion?”\n\n“Well, no one. But definitely not you. Definitely not me, either. That’s at least one thing we have in common.”\n\nTo his own surprise, Vic laughs. He opens his eyes again and looks at Stu, who is watching him warily from the front seat. Suddenly Vic is thinking about the tension in his stomach, about the overwhelming impulse to once again command Stu’s attention. It does feel strangely, powerfully good to see him.\n\n“What,” Stu says.\n\n“I’m sorry,” says Vic.\n\nStu stares at him. Vic supposes he can’t blame him for that.\n\n“You’re right. I don’t have the temperament. Thought I did for years. But I dragged you along with me, put you in all kinds of danger, and then tried to scare you again.” Vic looks out the window into the empty lot. He isn’t used to this. “Guess I still have a lot of personal work to do.”\n\n“Yeah, well.” Stu still sounds cautious, like he might be walking into a new trap. “If you can recognize it, that’s very healthy.”\n\nVic thinks he’s beginning to recognize something else. How many times had he ignored Stu’s objections and insisted they remain a team? Any Uber driver could have driven him through L.A.; probably plenty of them would have ended the night without using a golf club to beat him black and blue. Even then, he hadn’t wanted to relinquish Stu, not for a second.\n\nWhen he looks at Stu, Vic realizes with a shiver, he feels possessive.\n\nVic turns back to Stu and sees that he has been watching his face carefully. And there it goes again. Impulse control.\n\n“You wanna come back here?” Vic asks.\n\nHe is stunned to see, written all across Stu’s face, that the answer is yes.\n\nBut Stu can never just go with the obvious thing. He inhales sharply, turns back to face the front, and grips the steering wheel as if to steady himself. “Does that seem smart to you?” he asks.\n\n“I’d rather be brave than smart,” Vic says.\n\n“That is exactly your problem,” Stu tells him.\n\n“Maybe it’s yours.\"\n\nStu twitches, grinds the heel of his palm into his forehead. Then, with such sudden movement Vic almost jumps, he spins around in his seat, grabbing the headrest to propel himself, and climbs over the center console into Vic’s lap.\n\nVic lets out another growl and grabs the back of Stu’s thighs, pulling him closer. Stu reaches up and grabs Vic’s face with both hands, pulling him in, kissing him feverishly.\n\n“This,” Stu says when he breaks away, “is not smart, this is stupid, do not take this to mean I approve of––”\n\n“Please shut up,” Vic says, and Stu obeys long enough to latch his mouth onto the side of Vic’s neck.\n\n“Stupid,” he says again when he breaks away, but he isn’t stopping. Instead he moves his knee to push it between Vic’s legs, and that’s a surprise, somehow; Vic drops his head back and releases a noise from somewhere beyond his control.\n\nStu is on him with power and confidence that Vic never would have imagined. He pushes Vic’s shirt up and over his head with one hand, tossing it onto the car floor.\n\nVic is spaced out, borderline delirious. He can’t think of the last time someone moved him around the way Stu is doing now, fumbling with his jeans in the confined space and pushing his hand in to palm Vic through his shorts.\n\n“Is this okay?” Stu asks, always so good, so courteous.\n\n“It’s all okay,” Vic says. “I’m not gonna––all of it, it’s all okay.”\n\n“Okay.” Stu says it like he’s talking to himself, recommitting to the action. “Okay.” He pulls his hand out of Vic’s jeans and grabs them by the belt loops, helping Vic shimmy out of them. Then Stu puts his hand against Vic’s shoulder and pushes him to lie down. Vic goes.\n\nAbove him, Stu losing his shirt, ripping off his shoes and unbuttoning his pants. This is unreality, but Vic likes it.\n\n“Hold on, I’ve got…” Stu leans back across the console, popping open the glove compartment and rustling through it. He comes back victorious, holding up a miniature bottle.\n\nVic laughs out loud. “Jesus.”\n\n“Don’t blame me for the things people leave in my car,” Stu says, grinning too, leaning back over Vic and popping the bottle open. “You wouldn’t believe what this baby’s stashed with. Mace, two pocket knives, a very expensive looking bracelet..”\n\n“Fascinating,” Vic says. “C’mere.”\n\nBut Stu just looks at him, his eyes skimming Vic’s body laid out before him, taking it in. “You sure this is good? I mean, it’s a pretty major turnaround from the last time I saw you.”\n\n“I’m always sure,” Vic says. He’s impatient, feeling that hunger, that aching. “C’mere.”\n\n“Okay,” Stu says. “We don’t have to talk about it now. But that doesn’t mean we’re not gonna talk about it at all.”\n\nAnd that’s good enough, because then Vic can feel Stu’s hand on his thigh, pushing it up until Vic takes the hint and pulls his knees toward his chest.\n\nHe’s hanging half off the seat, and every time he moves he can feel the faded leather seat sticking to his skin; but more important is the feeling of Stu pressing into him, making everything else hazy around the edges.\n\n“Yeah,” he says out loud, because he knows Stu needs the encouragement; and then, sooner than he knows is really smart, but they’ve established being smart isn’t first priority, “More.”\n\nIt’s gotta be a sign of trust that Stu doesn’t question him, just pulls his hand away and leans down. He puts a hand to the side of Vic’s face, mutters Okay one more time, and pushes forward.\n\nOn the first thrust their foreheads bump. Stu’s eyes flutter closed and he lets out a gasp. Vic turns his head to the side, breathing heavily, trying not to acknowledge that his legs are already wrapped firmly around Stu’s waist. He’s loved this from the first time; that suddenly burning need, and then its full satisfaction, the feeling of wholeness.\n\nStu is driving into him and Vic is moaning, pitiful really, but what’s he supposed to do with Stu on top of him; nothing in the world but weight and feeling and the salty taste of skin when Vic opens his mouth against Stu’s shoulder.\n\nStu keeps thrusting against Vic’s most sensitive spot and then losing it again, finding it and losing it, and in a way Vic likes it, likes knowing that Stu is caught up and thinking about himself. Eventually it’s not enough, and he grabs Stu’s hand and guides it to his cock, and Stu starts guiltily, like he can’t believe he’d forgotten.\n\n“You’re good,” Vic promises, and Stu smiles at him, grateful and with such a gentle expression on his face that Vic has to look away.\n\nTurns out a hand on his cock is all he needs, and pretty soon he’s writhing under Stu, breathing as heavily as if he were in the middle of a foot chase. He can feel tension growing in his stomach, then his legs, then, frustratingly, in his neck and the muscles of his face.\n\nStu presses down hard, brushes his mouth against Vic’s ear, and of course that’s not what does it or anything, but that is the moment the tension finally breaks. Vic convulses wildly, wrapping his arms around Stu, digging his nails in, needing that stability.\n\nHe feels himself come onto Stu’s stomach, sensation breaking over him in long waves, until finally he settles sleepily with one leg still loose around Stu’s waist and the other dangling to the floor.\n\nStu is still hard inside him, and when Vic opens his eyes Stu is watching him, tender and still.\n\n“You can—“ Vic starts, but Stu is already pulling out. Vic groans, and for a moment could almost imagine going again. But Stu wraps a hand around himself, bracing against Vic’s chest with the other, and begins steadily jerking himself off.\n\nIn my mouth next time, Vic thinks, and then is overcome with such desire and fear he has to remind himself to breathe slowly.\n\nStu stares straight into Vic’s eyes the whole time, and that’s a kind of bravery Vic hadn’t even considered up to this point. Pretty soon Stu is panting too, looking broken wide open; Vic watches him come between them too, adding to the mess on Vic’s stomach.\n\n“Fuck,” Vic says.\n\n“Yeah,” Stu says drowsily. He looks at the Vic’s stomach, rising and falling more evenly now. “Aw, man! Don’t move.”\n\n“Gimme a break,” Vic says, but he stays still while Stu finds a tissue in the backseat organizer and gently wipes Vic clean.\n\n“Vic…” Stu says, and fuck his life, here it comes. “I just need to know, is this––”\n\nFrom somewhere on the floor, Stu’s phone pings. He frowns. “Sorry,” he says, grappling for it. He glances at the screen, and then back at Vic, face contorted like he’s halfway between laughter and exasperation. “Did you call––is this an Uber pool?”\n\n“Shouldn’t you be the one to know that?” Vic says, immediately halfway to the defensive. “Why’s it still going?”\n\n“Oh, sorry, something distracted me but I guess that’s my own fault.” Stu snorts. “I can just decline it.”\n\n“Don’t do that.” There’s a chance to get out of here without having a talk, and Vic is gonna jump on it. He sits up and starts pulling his pants back up. “Drop me at any bar, she won’t know.”\n\n“You don’t think she’ll smell it?”\n\n“Crack a window.” Vic pops the door open and walks around to the passenger seat, letting himself in and buckling up. He can be good too.\n\nStu is following his lead, pulling his shirt over his head and clambering back across the console into the driver’s seat. “Just saying, it is a little weird.”\n\n“You need the cash, right? What’s wrong with the cycling thing, anyway, you burn all your money on modern art and fair trade coffee?”\n\n“We put a lot into it, it’s not gonna turn a profit right away,” Stu mutters, pulling his own seat belt around himself.\n\n“I’ll help,” Vic tells him. “I’ll hand out the in-flight snacks.”\n\n“Naw.” Stu gives him a half smile. “Turns out people rate you higher when you leave them alone.”\n\n“Not surprised.”\n\nStu checks his mirrors and puts the car into gear. “That doesn’t mean I expect anything less than five stars from you, though,” he says, looking over his shoulder.\n\nVic pulls out his phone and grants the requested rating with exaggerated movements. It’s sappy, but when Stu grins, it’s worth it.", "link": "https://www.reddit.com/r/copypasta/comments/fst491/taken_from_a_post_from_rmoviescirclejerk/"}, {"title": "KnowYourPickle", "content": "Reader. Hey, reader! Over here at KnowYourMeme.com. Look at the website. Just look at it. You’re not gonna regret it. The payoff is huge.\n\nNotice anything? Maybe something green?\n\nOK. You’re not going to believe this: We turned Know Your Meme into a pickle! Boom! Big reveal: we’re a pickle website. What do you think about that? We turned into a pickle! What are you just staring at us for? We’re a pickle website!\n\nLike, we used to be a just website, but now, we’re a pickle. So crazy, right? Hilarious. It’s nuts. We’re nuts. No, wait, we’re a pickle.\n\nI know that some of you are probably thinking, “Wait, what? I thought you were an internet meme database.” Dang. I feel so sorry for those without a solid grasp of theoretical physics or extremely subtle humor to get the joke. It's actually the funniest stuff ever. Well, to be fair, you have to have a pretty high IQ to get this one.\n\nWhat does this mean? Uh, I think it’s pretty clear: We’re a pickle. So enjoy the new website -- er, I mean, pickle, which is what we are. So funny. God, my knee’s gonna be sore tonight … from all the slappin’.\n\nEnjoy, the pickle!", "link": "https://www.reddit.com/r/copypasta/comments/fsut9x/knowyourpickle/"}, {"title": "I'm in my boxers in an airport and I'm telling them they have to find and ask my wife before they get to see my weiner.", "content": "We get into these situations.\n\nI'm 6'1'' and 220 lbs. I'm a swimmer and triathlete. But unfortunately I'm built like a professional football player.\n\nMy wife was like. I don't understand? How did we get buy with no questions? She is also Taiwanese.\n\nDon't get me wrong. I have had to be strip searched in the middle of an airport. But I'm a swimmer so I am not ashamed of my body and I am generously proportioned downstairs. They had me down to my boxers in a airline terminal. It was lucky I was wearing boxers that day!\n\nThey were still giving me the whole suspicious look and had me held up at the gate.\n\nThey thought I was smuggling something in my shorts.\n\nI was just like, if you want to see my weiner, just ask! You probably should ask my wife first if you want to see my weiner. It's a pretty odd request.\n\nI'm in my boxers in an airport and I'm telling them they have to find and ask my wife before they get to see my weiner.", "link": "https://www.reddit.com/r/copypasta/comments/fsrkfh/im_in_my_boxers_in_an_airport_and_im_telling_them/"}, {"title": "Love for dick", "content": "I love dick, sometimes I just have this insatiable craving for them. I just love their shape, their smell, their taste. That strong, sturdy structure and that gentle curve. That round, sensitive tip and those hot, steamy balls. I just really love dicks. Sometimes, feeling wells up inside of me, and I don't have an outlet for it. No matter how much I try, I can never recreate the sweet, sweet feeling of a dick ramming down my male g-spot and shooting its warm nectar into my masculine womb. Even though I'm a guy, I want to be impregnated by another man's dick. Is that weird? Is it weird to lust for something that you have yourself?", "link": "https://www.reddit.com/r/copypasta/comments/fsujj6/love_for_dick/"}, {"title": "Found this on r/PewdiepieSubmissions by u/daveeeee888", "content": " Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe Cringe \n\n[source](https://www.reddit.com/r/PewdiepieSubmissions/comments/fs9269/thank_you_guys/fm0mz2r?utm_source=share&amp;utm_medium=web2x)", "link": "https://www.reddit.com/r/copypasta/comments/fsrcw6/found_this_on_rpewdiepiesubmissions_by/"}, {"title": "I'd love nothing more than to have a team of scientists, dressed in full PPE, slowly pull out a never ending chain of colorful handkerchiefs from my ass", "content": "I'd love nothing more than to have a team of scientists, dressed in full PPE, slowly pull out a never ending chain of colorful handkerchiefs from my ass while I'm on my knees in full clown regalia, with my face adorned with the honkiest red nose ever conceived. For hours, days, months, years, decades, this team of stunned scientists would pull more and more and more handkerchiefs, each covered in just a bit of uncomfortable mucus or slime of which the test results cannot confirm or deny whether it is human in origin. Like a cuckoo clock, every half hour, I would gyuck-a-hyuck giggle and laugh while honking my clown nose at an inhuman rate. What sanity of thee left, scientists, after pulling my handkerchiefs for so long? As the generations pass, I would be kept, preserved as some grotesque abomination, a thing that must be hidden, but never destroyed. Yet still, brave men and women who dare to read the redacted files and notes of yore scrawled, in desperation, by those driven mad, yes, these foolhardy scientists will take to my chambers and pull those handkerchiefs once more. They will find no end to it. They will find no happiness, no satisfaction. They will find only the dull horror of the infinite.", "link": "https://www.reddit.com/r/copypasta/comments/fsi8jm/id_love_nothing_more_than_to_have_a_team_of/"}, {"title": "4chan in 2020", "content": "no one:\nabsolutely nobody:\nstill nobody:\nnot a single soul:\nliterally no one:\nnot even big chungus:\nrandom incel on 4channel: SOIJAK(500).JPG LOL I QUOTE YOU\n[everyone disliked that]\nbaby yeed: wait that's illegal\nbrie larson: ok that was lowkey on point\npickle rick: *slaps roof of car* luke did i ever tell you about the time i turned myself into a pickle? it was an epic moment.\nluke: *is retarded*\nCIA: Bane?\nsans undertale: hey don't google HP Lovecraft's cat name\n[OP googles hp lovecrafts cat name]\nCIA: congratulations you got yourself caught!\nstan lee: *flies past in a spaceship* ooooh i dont care what universe you're from that's GOTTA HURT\n[everyone laughed]\nkeanu reeves: you're breathtaking!\narea 51 guards:i bet i can take keanu reeves\nkeanu reeves: you sure about that\nkeanu reeves: kills all area 51 guards\narea 51:wait thats illegal\nEveryone liked that\nCIA: am I joke to you?\nAlt right incels: there's no way star wars can be good agai....\nBaby Yeed: hold my beer\nBig chungus joined the chat\nDrumpf has left the chat\n4channeler: 'Yeah, I'm thinking this is kind of epic based pilled, maybe a bit of a coom moment?? Idk think I might post a frog.", "link": "https://www.reddit.com/r/copypasta/comments/fsu8vv/4chan_in_2020/"}, {"title": "Minecraft is the reason Gen Z is becoming so redpilled", "content": "Minecraft is the reason Gen Z is becoming so redpilled. Here's some fun things to think about:\r\n\r\nSteve: A white male ubermensch who conquers nature and carves it into his own dominion. He builds beautiful structures and ingenious redstone technology.\r\n\r\nZombies: Represent the bugman. Slow, stupid, and outnumber Steve by 100 to 1. They have no ulterior motives beyond consumption.\r\n\r\nCreepers: Represent muslims. Not only do they blow themselves up but they are also green which is a color strongly associated with Islam.\r\n\r\nEnderman: A tall black man who steals shit and can't swim\r\n\r\nVillagers: Big nosed merchants who live in the desert and have their hands constantly rubbed together\r\n\r\nNotch saw that Sweden was getting cucked and made Minecraft in collaboration with Pewdiepie in an effort to redpill the Aryan youth", "link": "https://www.reddit.com/r/copypasta/comments/fsr1kr/minecraft_is_the_reason_gen_z_is_becoming_so/"}, {"title": "Obama wants you to use the link to download raid shadow legends for 100,000 silver and a free epic hero", "content": "i used to play fortnite all nite. no sleep! but ever since obama told me to try raid shadow legends for free, i am addicted. this game is a game. it has graphics. it has characters. best of all it has a loot box mechanic to enhance my experience even more by adding another exciting chance based layer to the game! two week ago i spend all my money becoming a raid shadow legend. now i live in a dumpster outside a mcdonalds with free wifi. at night i sneak into the mcdonalds just like my new racoon dad, stripey, taught me to do so that i can charge my phone. through the cracked screen i am still perpetually amazed at the graphics of this game... they look so real! thank you obama, you truly change my life!", "link": "https://www.reddit.com/r/copypasta/comments/fsr1c0/obama_wants_you_to_use_the_link_to_download_raid/"}, {"title": "Where’s my Reddit Paper!!?", "content": "I’ve been wanting one all year!!1!1! My PARENTS have said no to Reddit gift card for Christmas!!@1! I just want the REDDIT PAPEPEPR!!", "link": "https://www.reddit.com/r/copypasta/comments/fssbfe/wheres_my_reddit_paper/"}, {"title": "A MAN HAS TURNED HOMOSEXUAL IN LEGO CITY", "content": "A MAN HAS TURNED HOMOSEXUAL IN LEGO CITY\n\nONLY YOU CAN CURE HIM", "link": "https://www.reddit.com/r/copypasta/comments/fstvps/a_man_has_turned_homosexual_in_lego_city/"}, {"title": "Addicted to ketamine, I am.", "content": "A long story, it is. Mmmhmmm. Explain it, I try.\n\nVietnam, it started. The trees were talking, all around me they were. Captured, I was. Whipped, i was. Freed, eventually, and saved from Vietcong, I became.\n\n...\n\nDeveloped PTSD, I did. The horrors in my mind, I get scared by. Mmhmmm, the napalm. To remove the PTSD, I had to. Mmmmmmhmmm. The ketamine, the answer it was.\n\nSoon addicted to ketamine, I was. Irresistible, it is. injects ketamine\n\nmmmmmmmhmmmmm\n\nBuy an old 2003 Honda Civic, the ketamine made me. School zones, I must speed. To cope with Vietnam, it helps.", "link": "https://www.reddit.com/r/copypasta/comments/fsldkw/addicted_to_ketamine_i_am/"}, {"title": "Why RUIN Johnson is OBJECTIVELY worse than Adolf Hitler.", "content": "I'm not saying Hitler did nothing wrong. However, all Hitler did was kill only 6 million Jewish people, and he contributed something to the world otherwise. However, Ruin has contributed nothing except being a hack. Let's look at the numbers.\n\n-Around 400 million saw The Last Jedi\n\n-Around 6 million Jews were killed in the Holocaust.\n\nThe Holocaust didn't make you suffer, you just died soon, while if your childhood dies, you have to live knowing you'll never be able to look at Star Wars the right way again. In addition, Hitler took Jews to the camps free-of-charge, while you had to pay to see The Last Jedi.\n\nAlso, Hitler didn't actively bribe victims of the holocaust to say they didn't like it; Mark Hamill was gutted and suicidal by the reaction to TLJ, but he claims to like it. (What a shill.)\n\nIn addition, Hitler never paid shills to promote him; unlike Ruin Johnson, whose shill army goes all around the Internet. Also; what has Rian done for the world? He's just murdered 400 million people's childhoods and wills to live, as opposed to Hitler, who was a good leader who helped us get into space.\n\nIn conclusion, Rian Johnson is OBJECTIVELY worse than Adolf Hitler.\n\n[\nsource](https://www.reddit.com/r/moviescirclejerk/comments/fi9qfs/aaaand_there_we_have_ityikes/fkhd0pa/)", "link": "https://www.reddit.com/r/copypasta/comments/fsdu0o/why_ruin_johnson_is_objectively_worse_than_adolf/"}, {"title": "Did you get BANNED? Gamers Rise Up! (The Division 2)", "content": "#RE: People who got banned, people who approve of the ban, people who disapprove of the ban, the entire playerbase\n\nNone of it matters. I don't care if you abused the glitch, or if you didn't abuse it. I don't care if you were banned or if you weren't banned. This isn't the point anymore. This whole fiasco is bigger than just us as individuals now, it centers around the royal US the players (hardworking, loyal customers that EARN our own money) versus the creators and publishers (devs and Massive). At the end of the day, it's a shit game. We know it. Massive knows it. Devs know it. But we all play it.\n\nWhether you got banned or not, whether you like or dislike the ban, it's happened. All of this discourse is EXACTLY what Massive wants. They want the player base to be fragmented because when we unite, we're way too much for them to handle. Because united, the players all affect their bottom line. When we deflect from the MAIN issue (re: Divsion 2 gameplay, ergonomics, and quality of life sucks) Massive gets to quietly take their sweet time working on these \"known issues\" and make a joke out of its customers (us).\n\nI don't need to list the issues we've seen. There are hundreds upon hundreds of posts on the forums, on this subreddit, in their customer service ticket line. We want them to fix the hive bug? Fix Black/White Tusk doing WAY absurd DPS? Fix Green Gear talents? Fix shit exotics? Fix piss poor RNG rolls? Fix lazy programming and game design? Hate how a cover-based game constantly kicks you out of cover, or doesn't let you use cover because of shitty AI mechanics?\n\nStop playing the game.\n\nWe give them so much money because of HOPE. HOPE that they do a better job. HOPE that they fix their game to our liking. HOPE that they fix all the bugs, quickly, professionally, at a high standard of quality. This hope is gone now. There is no more hoping anymore. Now is the time to do. Now is the time the player base needs to unite and demand our money's worth. I can list off reasons why I still play the game, why you play the game, but at the end of the day, you, me, everyone who plays this game we can all agree on one thing: things can be better, we want better, we deserve better, YOU deserve better.\n\nIf you're the general population, YOU work hard for YOUR money. Undoubtedly. YOU go to work for 8+ hours, YOU put up with bullshit customers, managers, bosses, red tape, bureaucracy, Karen's workplace drama, or even all of the above. Your time is worth money. You are worth money. You have value. Anyone and everyone with a sense of reason or logic can agree to this. You are worth what you decide your time is worth.\n\nAt this point, unfortunately, Massive and their devs have unanimously determined that their end content, their higher tiered gameplay, and their overall game, is not worth their time, our time, or our money. Even the devs played the game on \"Normal\" while filming SotG playing polarization and said it was fun, think about that for a second.\n\nSo at this point, before you start typing, before you hit that \"Continue\" button on the Division 2 log-in screen, before you do ANYTHING, think about this for a second, \"Is it worth my time, emotional, physical, and mental energy to continue participating in my own abuse?\"\n\nI'm not asking you to stop playing forever, but stop playing for now. For if/when they address AND FIX these issues. They want to show us they care? Now is the time to do it. How they respond to all their loyal customers leaving will determine whether they care about you or not. People who constantly say Massive doesn't care or people who sing the opposite? This will let them PROVE IT. banned or unbanned. like or dislike the game. DPS glitched or not. This game is fucked if we keep fighting with each other. We need to fight Massive, because THEY'RE the ones who built this game, THEY have the power to change it, THEY have the power to provide us with Quality Assurance in every sense of that concept.\n\nStand with me. We're all customers to them. But we're all gamers to each other. Together we can actually change this game and make it something worth playing. Worth sharing. Worth fighting for. United, we are strong, and they will listen. Fragmented, we only play ourselves. Divided, we only fight ourselves. Segregated, then Massive wins. Continue hoping for a lost cause. You've earned your money, make them earn theirs.\n\nLet's make a deal devs &amp; Massive. You say you \"read and closely monitor the forums and subreddits\" (literal quote from SotG), then let's make a deal. Your player base will deliver on the promise to stop playing this game for now. We'll come back when you deliver on your promises to fix your game AND provide us with the assurance that it is quality.\n\nPublic Service Announcement: because of the pandemic, there are tons of other games out there on sale, for free, not made by Ubisoft of Massive. Go check them out. Hell, go read a book. Get some extra sleep. Hug your loved ones and tell them you love them. Do anything but this, the game as it is, is not worth YOUR TIME.", "link": "https://www.reddit.com/r/copypasta/comments/fstobw/did_you_get_banned_gamers_rise_up_the_division_2/"}, {"title": "Listen here", "content": "Listen here you toe-eyed cabbage, i wasn't born into this world so your fat ass could choke out lo level insults at me. I hope you stub your toe in the dark and have to crawl around your bedroom at 3:47am in horrific pain after going to the kitchen for a midnight snack of cheese and cracker you absolute gormless minger", "link": "https://www.reddit.com/r/copypasta/comments/fsoyly/listen_here/"}, {"title": "I'd love nothing more than to have a team of scientists, dressed in full PPE, slowly pull out a never ending chain of colorful handkerchiefs from my ass while I'm on my knees in full clown regalia", "content": "I'd love nothing more than to have a team of scientists, dressed in full PPE, slowly pull out a never ending chain of colorful handkerchiefs from my ass while I'm on my knees in full clown regalia, with my face adorned with the honkiest red nose ever conceived. For hours, days, months, years, decades, this team of stunned scientists would pull more and more and more handkerchiefs, each covered in just a bit of uncomfortable mucus or slime of which the test results cannot confirm or deny whether it is human in origin. Like a cuckoo clock, every half hour, I would gyuck-a-hyuck giggle and laugh while honking my clown nose at an inhuman rate. What sanity hath thee left, scientists, after pulling my handkerchiefs for so long? As the generations pass, I would be kept, preserved as some grotesque abomination, a thing that must be hidden, but never destroyed. Yet still, brave men and women who dare to read the redacted files and notes of yore scrawled, in desperation, by those driven mad, yes, these foolhardy scientists will take to my chambers and pull those handkerchiefs once more. They will find no end to it. They will find no happiness, no satisfaction. They will find only the dull horror of the infinite.", "link": "https://www.reddit.com/r/copypasta/comments/fsnvoj/id_love_nothing_more_than_to_have_a_team_of/"}, {"title": "Jumpscare😳", "content": "My favorite jump scare is from Lord of the Rings when Bilbo is like BLaHH and scares Frodo so hard that they both start making out and then blowing each other 69-style, then Gandalf busts in mad because they didn’t invite him to the spit roast, so then they start pounding Gandalf in all of his wizard jokes and even some new jokes that he creates with magical spells - and it’s right around that point that I realize I’m watching the porn version of the movie and the real jump scare is when my mom walks into the room just as Gandalf drowns Bilbo in a river of wizard nut and I’m scrambling to put on some clothes while screaming “I THOUGHT IT WAS THE DIRECTOR’S CUT I DIDNT KNOW MOM!” But she sends me to a gay conversion camp anyway where I end up having so much gay sex that I somehow get pregnant. Anyway I sold that baby to scientists and used the money to buy the other two movies in the porn trilogy so I can keep poppin nuts that jump scare my cat", "link": "https://www.reddit.com/r/copypasta/comments/fstc75/jumpscare/"}, {"title": "Instagram should ban all pages that parents create for their baby.", "content": "Instagram should ban all pages that parents create for their baby.\n\nI do not understand why social media especially Instagram allow parents to make page for their babies and put photos of them to have a lot of likes and followers and to earn money on the back of their babies and without their consent.\nI know a woman who makes comments as if it is her baby who is writing the comment and in addition she answers to herself.. that’s crazy.", "link": "https://www.reddit.com/r/copypasta/comments/fsrab0/instagram_should_ban_all_pages_that_parents/"}, {"title": "Skyscraper", "content": "Hello everyone, just checking in real fast to let you know that i'm doing as well as I can be under the circumstances. After all, you know me to be a pretty pragmatic person, and so- before this calamity struck us all- I spent much of my time and money investing in- stockpiling provisions. Not provisions for my belly, but provisions for my eyes, and for my mind, in the form of 3D Blu-rays, Okay? And as you can see now that has paid off in spades. Because I have amassed one of the largest, most comprehensive, and superior collections in this or any other universe. However, before this calamity struck us all, I- much like most of you- found myself so busy in my day-to-day activity, that I hardly had any time to appreciate and indulge myself in my beloved hobby. So, now, I make it a point at least once a day to peruse my collection in order to raise my joy. I will simply run my fingers along the spines of these cinematic masterpieces, arriving at a randomly chosen picture- ah, Skyscraper 3D. There is is. It says right here, starring Dwayne Johnson. Now, allow me to evaluate this cover for you, okay? I'm gonna have to ding them, i'm gonna ding them alittle bit on the cover. I feel like they got the cover art right, the image is right, here you see the Rock hanging off the skyscraper, the city far below him. But it makes you wonder; why couldn't Universal have loosened their purse strings- spent the little extra dough in order to get the holographic lenticular cover. Wouldn't that have been a more powerful effect? If you would see the bulging Johnson hanging from the building, high above the looming city below? I think that would have been abit more powerful. However I do have to give them points for this little feature right here; here it is, emblazoned right on the cover, over 30 minutes of explosive bonus features. Which I like, i'm a fan of bonus features, okay? And what I like that they've done here, is they didn't put this on with an easy-peal sticker. This is actually printed on the cover, so, there will be no removing this, okay? This will be on this cover long after you and I have left this Earth, okay? And, uh, I like that, I like the permanence of it. So, out of five stars, I give it 3 stars overall for the cover. It's a pretty nice design, but alittle bit of a missed opportunity. As for the movie itself? I don't remember it too well, I was kinda in and out of consciousness when I was viewing it. I remember waking up on my couch several times and being surrounded by glowing embers, beautiful red embers floating in the air all around me. It must have been a scene with alot of fire in it, and for that reason I liked it, and for that reason I highly recommend it. This is a good picture, okay? So, that's all for now, here I am, rat-holed in my hobble, with my collection of 3-day- uh, 3D Blu-rays to keep me company. So I hope you're safe out there, and I wish you all the very best.", "link": "https://www.reddit.com/r/copypasta/comments/fst62n/skyscraper/"}, {"title": "Found in AskReddit", "content": " I'd love nothing more than to have a team of scientists, dressed in full PPE, slowly pull out a never ending chain of colorful handkerchiefs from my ass while I'm on my knees in full clown regalia, with my face adorned with the honkiest red nose ever conceived. For hours, days, months, years, decades, this team of stunned scientists would pull more and more and more handkerchiefs, each covered in just a bit of uncomfortable mucus or slime of which the test results cannot confirm or deny whether it is human in origin. Like a cuckoo clock, every half hour, I would gyuck-a-hyuck giggle and laugh while honking my clown nose at an inhuman rate. What sanity hath thee left, scientists, after pulling my handkerchiefs for so long? As the generations pass, I would be kept, preserved as some grotesque abomination, a thing that must be hidden, but never destroyed. Yet still, brave men and women who dare to read the redacted files and notes of yore scrawled, in desperation, by those driven mad, yes, these foolhardy scientists will take to my chambers and pull those handkerchiefs once more. They will find no end to it. They will find no happiness, no satisfaction. They will find only the dull horror of the infinite.", "link": "https://www.reddit.com/r/copypasta/comments/fspqdi/found_in_askreddit/"}, {"title": "America", "content": "Fascinating. Amazing that the backstory is how he accidentally sailed on a boat that didn't have a bathroom and just thought to himself eh I'll hold it in until we get there but of course midway he couldn't resist anymore and an intense defecation session of 108.5 non interrupted hours ensued through which he didn't break eye contact with his crew members. Of course the result is the continent we today know as America. Mesmerizing. I love history.", "link": "https://www.reddit.com/r/copypasta/comments/fst3xh/america/"}, {"title": "SAY IT AIN'T SOOOOO!", "content": "you're a girl who listens to w-w-w-weezer? \n\n&amp;#x200B;\n\n\\*eyes pop out\\* \n\n\\*jaw drops down\\* \n\n\\*heavy panting\\* \n\n&amp;#x200B;\n\nAWOOOOGA!  \n\n\nSAY IT AIN'T SOOOOOO!", "link": "https://www.reddit.com/r/copypasta/comments/fst0n0/say_it_aint_sooooo/"}, {"title": "My piss was clear today", "content": "Brobrobro I gotta show you something.\n\nIt’s a video. \n\nOf me peeing. \n\nBut I have a reason. \n\nTrust me. \n\nThe pee was so clear. \n\nI was drinking a lot of water and it was very ***white*** and ***clear*** so I felt the need to record it. \n\nIt was so clear that it merged in with the water in the toilet. \n\nTherefore, I didn’t feel the need to flush. \n\nLemme know if you wanna see the video\n\n~ The Pee Guy", "link": "https://www.reddit.com/r/copypasta/comments/fsnenk/my_piss_was_clear_today/"}, {"title": "This is my last post.", "content": "Yes. I'm completely serious. You see, I'm not who you all think I am. Not at all. Currently, I'm a writer for Washington Post, living in a small studio apartment, always looking for the next big story, barely scraping by sometimes. I was asked several months ago by my editor to do a piece on the so-called 'shitpost' community on Facebook that seems to become more and more popular by the day.\n\nInitially, I was intrigued. The humor was bizarre, yet interesting. Nonsensical, yet genius. I spent several months interacting with people I had never met before in my life, learning the culture, what was \"cool\" and what wasn't. Eventually, I began to make my own posts, testing the waters now and then. And eventually my own posts started getting noticed, and maybe for a minute or two I understood why you all do this. But that didn't last long. And with time, I began to notice how stale the content truly was. How the same 'memes' could be spammed over and over again, and still get massive amounts of attention.\n\nAnd I also began to notice something else. The viciousness with which you attacked each other. The semi-constant bullying and harassment. Each day, it made me even more sickened than before, to the point where you people made me start questioning everything about reality and what I knew about it.\n\nI couldn't eat. I couldn't sleep. I was drinking 2 bottles of milk every night. But, finally, my mission is complete.\n\nTomorrow, we will be publishing a comprehensive guide on this group, potentially exposing some of your admins' most well kept secrets. I'm deactivating this account at midnight, but before I do, I just want to let you know you all make me sick.", "link": "https://www.reddit.com/r/copypasta/comments/fsszxb/this_is_my_last_post/"}, {"title": "Found on r/videos", "content": "Dang, this post reminds me of a twitch streamer I used to watch whose streamroom had a ceiling mirror that she wasn't allowed to take down cause it was a rented apartment. Chat had so many inside jokes about it and I had made my share of \"oh man that would be so hot for watching me cry and jerk off\" type quips.\n\nI'm sad now cause now I have to relive the worst screwup of my life. I had been faithfully watching her for almost a year and she mostly played League and Hearthstone plus sandboxy fun games like Little Big Planet and Minecraft. Those games weren't really my cup of tea put her personality and sense of humor were so great that I didn't care.\n\nShe only had about 60 average viewers but we all adored her and there was a great sense of community among everyone. I was super excited that night cause it was her one year twitch anniversary and she invited us all to drink with her to celebrate.\n\nI woke up with a massive hangover still in front of the computer and instantly went to her twitch page to check out the vod and was met with a \"this account does not exist or has been deleted message.\" I'm not proud but my first thought was hoping that she had gotten a bit to flirty in her drunken state and maybe even flashed chat which led to a temporary ban from twitch, I then went to her twitter and her last tweet was \"I'm sorry, I just can't even...I'm out.\" I started to replay the night back in my head and noticed one of my \"hidden\" folders was open and ohhh no..oh god no...\n\nThe night started out great, with many toasts to her subs and longtime lurkers but as she drank more she gradually got more and more morose and started to open up about her personal life. She said she loved streaming but she wanted to do this as a career and her parents had given her a year to prove it was viable until she needed to get a \"real job\" and her time was pretty much up and she was scared. She also talked about how she was undateable (very untrue!) and no man would ever want her. All she really wanted out of life other than making it as a streamer was to be a housewife and mother but she would probably screw that up too, fuck my life!! And she tilted the webcam away so we couldnt see her cry.\n\nI was drinking shots of whiskey to her swigs of champagne and was even drunker than her at this point, and typed \"Actually you'd be an amazing mother!!!\" And I then uploaded a shota gallery of her and me I had been working on for 6 months to imgur and being a longtime mod I was able to link it directly in chat.\n\nI'm a cartoon storyboard artist by trade and had put more effort into this than my real job. In between the sex parts it was full of inside jokes from the stream including the ceiling mirror and the storyline was basically \"me coming home from school and walking in on mom in the shower\" which should be familiar to anyone familiar with the \"genre.\" It even involved several personal aspects of her life I had discovered from a bit of internet detective work.\n\nSeeing the look of horror dawn on her face as she scrolled in disbelief I immediately started apologizing but she ended the stream and I screamed fuck!!! and punched a hole in the wall and started chugging the whiskey in an effort to forget what I did and soon passed out.\n\nIt's been 3 months and she hasn't come back, the only saving grace is I deleted the gallery before passing out and nothing made it onto r/cringe or livestreamfails. If I'd just offered her kind words of support she probably would have ended up streaming on Saturdays and we might even have a budding relationship going on.", "link": "https://www.reddit.com/r/copypasta/comments/fssyx8/found_on_rvideos/"}, {"title": "pinch punch", "content": "Pinch🤏 Punch👊 first🥇 of the 🗓️MONTH🗓️", "link": "https://www.reddit.com/r/copypasta/comments/fsvwda/pinch_punch/"}, {"title": "So much I hate about internet culture in general", "content": "The fucking repetitive comments. Always the same fucking comments.\n\nAlso edited comments thanking someone for gold. Fuck you.\n\nThere is so much I hate about the threads on Reddit. So much I hate about internet culture in general.", "link": "https://www.reddit.com/r/copypasta/comments/fsqvze/so_much_i_hate_about_internet_culture_in_general/"}, {"title": "Changing upvotes/downvotes", "content": "Wow the amount of second guessing some people put up with is just... yikes!  I'm constantly aware of my surroundings so I've never had to change my vote like that, ever.  Having a better sense of humor than to go to meme subs where things like this would be posted helps too.  \nHowever, I don't actually think this is unfunny.  See, it takes a certain amount of class to spend entire minutes of your life taking pictures of yourself to put on memes to forever immortalize your face on the internet.  Just making normal memes with drawings or words in MS paint means you can easily dissociate from your memes, these people are actually owning up to this.  \nRather than just looking at the surface level cringe on the face of the meme, some of us take the time to look at the entire value of it, and this is a high value meme.  Now you may be thinking, did you change your vote?  No, I did not, I downvoted this post in the first place, but usually I am aware enough of how others see comments to not make a boring comment announcing my vote.  \nInstead, I just downvoted it quietly for not only not being cringe, but being part of a greater meme meta reference that many not versed in internet culture will never understand.  He is not actually serious when making those faces, he is ironically mocking a viral post made by SabrinaXo.", "link": "https://www.reddit.com/r/copypasta/comments/fsvsq1/changing_upvotesdownvotes/"}, {"title": "Slip out a single nut", "content": "Naw man. That might have worked back in the day, but girls aren't into that these days. Whippin' on your dick will get you canceled with a #MeToo twitter post. This isn't 2012....you can't just go shaking your dick at strangers....\n\nWhat you do is slip out a single nut. Reach in through your fly and pull one out. Let it dangle there. It will take her a minute to process what she's looking at, but once she recognizes what that lump of flesh is, she demand to see the whole package. Alternatively, she has a right to flick it if she isn't in the mood. Equality.\n\nLooking at nuts is the new Astrology. You can tell a lot about a man, like what kind of lover he is, by looking at his sack and reading his ball hair like tea leaves.", "link": "https://www.reddit.com/r/copypasta/comments/fsvrfo/slip_out_a_single_nut/"}, {"title": "ass clown", "content": "I'd love nothing more than to have a team of scientists, dressed in full PPE, slowly pull out a never ending chain of colorful handkerchiefs from my ass while I'm on my knees in full clown regalia, with my face adorned with the honkiest red nose ever conceived. For hours, days, months, years, decades, this team of stunned scientists would pull more and more and more handkerchiefs, each covered in just a bit of uncomfortable mucus or slime of which the test results cannot confirm or deny whether it is human in origin. Like a cuckoo clock, every half hour, I would gyuck-a-hyuck giggle and laugh while honking my clown nose at an inhuman rate. What sanity hath thee left, scientists, after pulling my handkerchiefs for so long? As the generations pass, I would be kept, preserved as some grotesque abomination, a thing that must be hidden, but never destroyed. Yet still, brave men and women who dare to read the redacted files and notes of yore scrawled, in desperation, by those driven mad, yes, these foolhardy scientists will take to my chambers and pull those handkerchiefs once more. They will find no end to it. They will find no happiness, no satisfaction. They will find only the dull horror of the infinite.", "link": "https://www.reddit.com/r/copypasta/comments/fsqtf2/ass_clown/"}, {"title": "Copy Pasta", "content": " \n\n&gt;gf is prego  \n&gt;  \n&gt;we like to get kinky anyways  \n&gt;  \n&gt;one night things get particularly saucy  \n&gt;  \n&gt;i'm sticking my noodle in her when I notice weird fucking chunks coming out, so I turn on the lights  \n&gt;  \n&gt;wtf it's red everywhere and she's obviously not on her period  \n&gt;  \n&gt;i look up at her, she's got a glassy, jarred look on her face and she's not answering  \n&gt;  \n&gt;ohshitohshitohshitohshit  \n&gt;  \n&gt;i rush her into my car and speed all the way to the hospital  \n&gt;  \n&gt;she's still bleeding everywhere  \n&gt;  \n&gt;by the time we get there, she's not bleeding much anymore, but all the color has drained and she looks colorless and almost transparent  \n&gt;  \n&gt;oh shit, she looks like she's in a vegetative state  \n&gt;  \n&gt;storm into to the emergency room, cary her to the nearest doctor and explain eveything  \n&gt;  \n&gt;he takes one look at ther and says  \n&gt;  \n&gt;\"sir, i'm sorry, there's nothing we can do\"  \n&gt;  \n&gt;\"WHY THE FUCK NOT???\"  \n&gt;  \n&gt;\"we don't operate on empty jars of spaghetti sauce\"", "link": "https://www.reddit.com/r/copypasta/comments/fsqtdn/copy_pasta/"}, {"title": "I found this comment on a video about ants and termites", "content": "I found this randomly on a post about Termites and Ants\n\nSpecial thanks to u/blackjack_oak\n\n\nIt’s insane how some ant species will raise and protect aphids to collect their honeydew...exactly like we do to cows...crazy to imagine how that behavior started...\n\n……………………………………………………….\n\n“Hit the gym, squats and deadlifts on Friday. Headed down the road to fish. Threw a rooster tail in the creek, caught a decent-sized Redbreast Sunfish—not big enough to eat, though, so I threw it back. Grabbed a cold Modelo out of the cooler, chugged it. Headed back—met up with probably the cutest femboy in the neighborhood. I mean this dude is fem even without makeup on. Spit between his thighs and fucked him real quick, Roman style. Those thighs were warm and smooth,  so brother you know I didn’t last long. Not a bad Friday.”", "link": "https://www.reddit.com/r/copypasta/comments/fssrdf/i_found_this_comment_on_a_video_about_ants_and/"}, {"title": "65 year old guy from askreddit", "content": "Some of us are 65 and have smoked more weed than that rap guy Snoopy dog and had more ass than a toilet seat. I got laid before I had pubes. It was 1961 and it was my sister's teddy bear. Teddy dumped me over the summer. I killed him and buried him in the yard. I told my sister he hitchhiked out west to try his hand at the theatre. It was like a donkey show in Tijuana but it was a Teddy show in Sonoma. I miss my childhood.", "link": "https://www.reddit.com/r/copypasta/comments/fspamf/65_year_old_guy_from_askreddit/"}, {"title": "I found a bug .. with the dimonds ..", "content": " \n\nThey should take the dimonds out of minecraft.  they don't really help the game play.  I don't mean to stereotype. but their girly.  they look kind of girly and it's like your playing with arts and crafts when you use them.  they should also take out the cats because cats aren't real minecraft animals.  you don't need things like dimonds or buckets in minecraft it's not really what mine craft was intended for.  the buckets are girly.  it's like if a miner walked around in a cave with a 'pretty metal bucket'.  I think the girls kind of messed up minecraft.  they need to create a different minecraft for the girls and it will be called minecraft vanilla.  because vanillia is a girls word.  they need to take out the dolphins. they are girly.  they don't build anything.  all they give you is fish meat they need to give you dolphin meat.  maybe an ender pearl.\n\nminecraft should be more about constant bombardment of mobs and the endermen should be more invadeing and like destroy all your creations constantly.  like sometimes ridiculously.  like in the air and they send the creepers.  sometimes your whole map get erassed and it's called the nuke. \n\nyou should have to pay to use dimonds in minecraft.  and it would be more about makeing jewlry and stuff but that be for a girl.  the minecraft vanilla would be like makeing clothing and darning socks.  and you have to sit there and darn socks and have a chest of darned socks and collect them. \n\nminecraft is basically just a cheaper coppy cat of zelda.  it's kind of a glitch?  but it's okay just you have to add link and zelda but not link though because he wasn't spicific enough.  it be like dark link with out the hat. because they didn't have those hats back then.  and it should be that your a peasant farming not an actuall like you build the houses. \n\nIt should be more of a bad cheap knock off of zelda but it's dark link and he doesn't have a hat and your a peasant farming and the mobs are constant bombardment. and you have to send your farmed food to the kingdom.  and there still is red stone though but more spicific and also more realistic.  but like actually how electricity works and it's like wires.  and you have to solder and everything and you can make minecraft in minecraft. \n\nThe bees were kind of for a girl too. so please take them out.  it should be that in vanilla minecraft you play with the bees but in minecraft java it's more about mindless constant mineing like just a solid massive block of one type of rock.  and then you would get three coal. maybe it's less about useing a pick axe because that's not how they really mine and more of you have to use trucks and stuff and you mine massive amounts and just get like 3 dust. \n\nand you should have to choose your actuall profession like either farmer or mob fighter or miner. so if you want to mine you would pick miner but then you wouldn't do much farming. \n\nand it shouldn't be about actuall mineing it should be a war simulator.  bassically all the video games are really just call of duty if you think about it so wouldn't it just be call of duty.  but then whats the point of minecraft is that it's just cheaper graphics.  so like block graphics with call of duty style game play.  maybe your sword is a mealy weapon like the knife in call of duty but your gun is a bow and arrow.\n\nI don't mean to sterotype or something but girls ruined warhammer.  they made the space marines like a girls army.  the recent update.  and i think it's great that girls are getting into minecraft and warhammer but they need to have protocalls to make sure that girls don't make these franchises like a girl's game like aneta sarckeshien.  is zelda isn't a game about linkle it's about link cause otherwise what's the point of zelda is it's just a bunch of random midevial stuff like all the other games. so minecraft is like a game spicifcally about steeve the miner but he needs to actually be dressed as a miner. but it wouldn't make sense that it was steeve steeve would be like the farmer. but the game would be about dark link with out his hat.  but he gets other armor like in breath of the wild. so it's not link.\n\nwhen you make a video game you have to say what time period it is ?  is it the future or call of duty or the mediveal ages?  so you wanted to make a game about the midevial ages so it basically just be zelda but they allready made that game.  so you have to make your own characters.  and so it be a different princess and it would basically be a dark link without a hat with breath of the wild armor and then the sheild from minecraft and a stone axe.  but he uses dinomite. but then it's just about that character because why does minecraft have all these characters? \n\nand it wouldn't be minecarts it would just be a train and it like loads you into the differnet maps like in minecraft the minecart wasnt that spicific.  cause what's the point of minecraft?  is that tetris is a puzzle game. and all the other games are basically just call of duty if you think about it so like zelda was like the earlier type of call of duty but now they have gun game mechanics so he would basically get a gun after a while.  or a sling shot basically.  and so then minecraft would be zelda then but they allready made zelda the video game. \n\nand the physics should be fixed like the redstone would just be wires. but you can use the dust too. but like the minecart wouldn't be like a cheap un finished box that i know you guys haven't actually figured out completly yet.  so it be a train then.  but that just be roller coaster tycoon.  and they need to have like things like engines but you have to build the engines and you can make minecraft in minecraft and then hellicopters.\n\nall the dimond stuff should be taken out.  like even books.  because it isn't an actuall book.  if you want to read go pick up a book seperatly. but why would you read a book in a video game.  it would just be point and shoot.\n\nand it isn't difficult enough.  it would be basically constant bombardment of dungeons to explore but then why does the map automatically generate?  so basically it should just be like 12 levels like in call of duty and it would be like \"dude have you played minecraft medieval conflict tales of the princess minecraft lady 3\".\n\nand you should pick an actuall minecraft flag and take out the flags in minecraft like basically you can only make the 20 different countries anyways so basically it would be like you use coins like on ps4 store and physally have to purchase a flag or basically it would just be a poster but the game allready has a flag. \n\nand also that there aren't any ships.  most of the map would just be water.  and the game would be like 12 or 8 levels and then one big map like in an actuall game and that's like the main objective map that goes to the different other dungeons.  and there isn't any other worlds.  you should decide now that you made the different biomes what the biome is for the whole game.  but if you want to make another biome that would be a sequal and wouldn't be the actuall different world. ", "link": "https://www.reddit.com/r/copypasta/comments/fsspx5/i_found_a_bug_with_the_dimonds/"}, {"title": "How to get a woman", "content": "Naw man. That might have worked back in the day, but girls aren't into that these days. Whippin' on your dick will get you canceled with a #MeToo twitter post. This isn't 2012....you can't just go shaking your dick at strangers....\n\nWhat you do is slip out a single nut. Reach in through your fly and pull one out. Let it dangle there. It will take her a minute to process what she's looking at, but once she recognizes what that lump of flesh is, she demand to see the whole package. Alternatively, she has a right to flick it if she isn't in the mood. Equality.\n\nLooking at nuts is the new Astrology. You can tell a lot about a man, like what kind of lover he is, by looking at his sack and reading his ball hair like tea leaves.", "link": "https://www.reddit.com/r/copypasta/comments/fssm6g/how_to_get_a_woman/"}, {"title": "COVID-19", "content": "I don't belive in the Virus. They have created the perfect way to control us. They can now track us whereever we go. They limit our social conact so we don't get riled up against their system. They lock away the people who don't fit in their system. And once the vaccine is out they will mass poison us. Resist now. The lizard people are on to us. Glorious President Trump is the only human leader in the world right now. Germany is already overtaken by Lizard people. Italy resisted a bit and you can see how many have died. Arm yourself. They'll be coming.", "link": "https://www.reddit.com/r/copypasta/comments/fsvl8c/covid19/"}, {"title": "average brony incel neckbeard 4chan user", "content": "\"You cant tell me what to do\"\n\n*He says with loud and pronounced breaths, he feels as his three ching gather moisture, the smell of cheetos rolling down his chins, accompanied by the green tint of mountain dew.*\n\n\"I will show them, ill show them what i think of their PC character!\"\n\n*He pronounces loudly, his voice echoing through the walls in his moms basement, stoped by the seemingly endless bottles filled with liquids, and the cabinets of jars and ponies.*\n\n*Somewhere in the overworld, where* ***normies*** *dwell, a muffled cry of his mother as she rethinks the choices she made for him to be here.*\n\n*He gets up from his double sized chair, the workings and spring for adjusting the height creak and shiver, the sound of something snapping remembers him to ask mom for another one.*\n\n\"Aw damnit, the second one this week!\"\n\n*He waddles towards the boxes beside his bed, the sound of moist cardboard hitting the ground, he digs, his grubby hands flailing to grab something amidst the sea of thrash, but he succeeds.*\n\n\"I may be a bit dusty but ill show them.\"\n\n*He pulls out his wacom tablet, not the finest machinery but itll do its job, he treks back to his seat, connecting it all and booting up paint tool sai, the computer trembles as he sits back down and connects the tablet.*\n\n\"Ill fucking show them.\"", "link": "https://www.reddit.com/r/copypasta/comments/fsviy3/average_brony_incel_neckbeard_4chan_user/"}, {"title": "Fuck Buck", "content": "A Buck has been nerfed in Ubi City! \n\nHEY!\n\nFire the balance team! \n\nGrab the pitchforks!\n\nBitch on the R6 Reddit!\n\nAnd send death threats via America Online! \n\nThe new Claymore Collection from Ubi City\n\nEach patch sold separately", "link": "https://www.reddit.com/r/copypasta/comments/fsvhpd/fuck_buck/"}, {"title": "Woke child", "content": "Agatha gaped at her child yet again.\n\n\"First of all, mommy, the sociopolitical climate of the middle east has been boiled down to something bordering on parody here.\"\n\nYoung Jesse was pointing at the political ad on her computer screen. Agatha moved to skip it, but Jesse insisted she continue watching.\" Everyone knows the people on the ground yearn- no, they crave- a viable two-state solution, but hateful rhetoric from the bitter powers-that-be has led to extensive alienation and enmity between brother and brother. Our humanity should be what unites us, not that which divides us.\"\n\nAgatha furiously scribbled this down for her Facebook feed, a tear streaming from her eye. *You're so wise,* she wanted to tell her blessed daughter. But she knew her praise would sound like empty parental flattery.\n\nJesse continued her lecture on the Gaza strip, expounding on all the numerous ways that an Israeli economic cooperation could spur new investment to the region and bring peace at last. She discussed the various tenets of shi'ite law and how its central pillars can again be unified with sunni Islam. She explained how to untangle the stunted development of a region eternally broken by meddling European powers slicing up land they never owned. But more than these mere words, she explained intrinsically to Agatha that the future would indeed turn out all okay. With her daughter's unalienable hope, how could anything at all fail?\n\nAs she wrote down these wise words, she remembered the story of the prophet Kassandra, who was gifted with perfect foresight but eternally cursed to have her gifts ignored. Agatha knew that her daughter's wisdom would be dismissed as fabrication, but she solemnly continued on in her diligent transcription. She cried silently for all that might be lost as the wisdom was spurned, but indeed this was her burden: to be gifted with absolute wealth of knowledge, but forever unable to share in its gift. To sit among the starving with a great buffet table before you, unable to invite the weak and hungry. To watch their hungers consume them and their hatreds lay waste to their table. But to cease the transcription is to give in to such hatreds. Such wanting. Such suffering.\n\nAnd so the Facebook posts continue. Tragically, but necessarily.", "link": "https://www.reddit.com/r/copypasta/comments/fsvhkl/woke_child/"}, {"title": "God I want to fuck thanos", "content": "god i want to fuck thanos so badly. everytime i saw infinity war and endgame ive wanted to cum so badly in the theaters, once i masturbated while in the theater and i got kicked out, ever since then ive been watching those movies and masturbating at peace at home. Ive rewatched those movies countless times and everytime ive cummed so hard just at the THOUGHT of thanos. His thicc ass looks so good and could taste like large grapes, his cock and balls would be the best grape flavor anyone has ever tasted, his cum would taste like fine aged wine, his ass is so fucking THICC. god i want to fuck thanos.", "link": "https://www.reddit.com/r/copypasta/comments/fsvgel/god_i_want_to_fuck_thanos/"}, {"title": "The magic handkerchiefs", "content": "I'd love nothing more than to have a team of scientists, dressed in full PPE, slowly pull out a never ending chain of colorful handkerchiefs from my ass while I'm on my knees in full clown regalia, with my face adorned with the honkiest red nose ever conceived. For hours, days, months, years, decades, this team of stunned scientists would pull more and more and more handkerchiefs, each covered in just a bit of uncomfortable mucus or slime of which the test results cannot confirm or deny whether it is human in origin. Like a cuckoo clock, every half hour, I would gyuck-a-hyuck giggle and laugh while honking my clown nose at an inhuman rate. What sanity hath thee left, scientists, after pulling my handkerchiefs for so long? As the generations pass, I would be kept, preserved as some grotesque abomination, a thing that must be hidden, but never destroyed. Yet still, brave men and women who dare to read the redacted files and notes of yore scrawled, in desperation, by those driven mad, yes, these foolhardy scientists will take to my chambers and pull those handkerchiefs once more. They will find no end to it. They will find no happiness, no satisfaction. They will find only the dull horror of the infinite.", "link": "https://www.reddit.com/r/copypasta/comments/fsoxdl/the_magic_handkerchiefs/"}, {"title": "The Borg's phrase, but it's got a bit of a twist", "content": "We awe the Fuwwy. Lowew youw shiewds and suwwendew youw buwgywuwgies. We wiww add youw biowogicaw and technowogicaw distinctiveness to ouw own. Youw cummies wiww adapt to sewvice us. Resistance is futiwe. OwO", "link": "https://www.reddit.com/r/copypasta/comments/fssdgj/the_borgs_phrase_but_its_got_a_bit_of_a_twist/"}, {"title": "This isn't funny anymore", "content": "\nYeah it was haha when it first came out of the womb, but now it's aged. It is no longer funny. Haha i get it you want cummy to rape you and let you eat his shit. Haha so funny and original, like it has never been done before. It's dead. Close this sub. It's no longer funny. Also Cummy has married OwOifier so fuck off, cummy isn't a cuck. It is no lnger funny, stop making these awfull, unfunny and useless jokes. Rant over", "link": "https://www.reddit.com/r/copypasta/comments/fsscui/this_isnt_funny_anymore/"}, {"title": "My Name Is (Eminem)", "content": "my name (who?)\n\nmy name (what?)\n\nI am slim shady (cool)\n\nalas, you know my name (correct?)\n\nPerhaps, I do not know my name (no)\n\nI need the attention of the class? (maybe)\n\nMy name's slim shady (alright)\n\nkids, do you appreciate violence? (mm yes yes)\n\nDo you want to see me impale my eyes? (nonoononooon)\n\nWanna copy me? (yes)\n\nwanna get fucked up worse than i am? (what did you say please speak louder)\n\ni want to get straight\n\nBut i cant figure out which woman i want to fuck (oh)\n\nDr. Dre gave me pills uhhuh\n\nwhy is your face red? have you been ejaculating?\n\nWhen i was 12, I was someone else\n\nbecause i committed suicide\n\nPamela Lee Stripped\n\nshe has now fallen\n\nI smoked weed, it fell on my ass and went fast\n\nhe sat down too fast\n\ncome here! (Shady, that is my dog!)\n\ni pissed on the world\n\n((((insert more \"my name is\" stuff because i was too lazy to type))))\n\nMy english teacher removed me\n\ni am 35\n\nStapled him\n\nStapled his nuts to his vine comp\n\nmy jacket is zipped up\n\nmy dick is stuck\n\npedestrians in a space ship\n\nlets be friends!\n\ni was lied to\n\nMy mom smokes more weed than me! &gt;:C (Damn!)\n\nI'm a famous rapper\n\ndisrespect my mother (Thanks!)\n\nwomen rush your hands\n\nusher fan\n\nWhite Castle wanted!\n\nThanks for support, Ass!\n\n(((((more \"my name is\" stuff)))))\n\nThis kid is locked\n\nOperate, Dr. Dre! Operate!\n\nI'm scared! (fuck it)\n\ncemetery\n\nam i cumming or pissing?\n\nI can't decide!\n\nToo much vodka!\n\nI will not drive (no) Because i was deprived\n\ni have had sex\n\nMy Clothes are ripped!\n\nI'll fuck! (c'mere)\n\nI'm hungry!\n\nI want THE TITTIE MILK!\n\nI am strapped in the bed\n\nI kill myself! (Bang!)\n\nim mad! (ahhh!) and my dad? (perhaps)\n\nI killed him, in a dream!\n\n(((more \"my name is\" stuff)))\n\nthe end", "link": "https://www.reddit.com/r/copypasta/comments/fsvawz/my_name_is_eminem/"}, {"title": "Ahhhehehehhehehheeheheh", "content": "I am a registered sex offender 🤫", "link": "https://www.reddit.com/r/copypasta/comments/fsq8ba/ahhhehehehhehehheeheheh/"}, {"title": "One of the last big sitcoms", "content": "Low key the housekeeper in 2 1/2 Men was probably second only to Charlie in how funny she was. Really made a lot of the scenes by calling Charlie on his b.s. and making jokes at his expense. Also too bad they wrote Charlie out when he went bonkers. One of the last big sitcoms", "link": "https://www.reddit.com/r/copypasta/comments/fsv8ip/one_of_the_last_big_sitcoms/"}, {"title": "BIG RUMOR 😩🙈", "content": "there’s a rumor going around that my DICK is rlly good i’m so fkn horrified how could someone leak information as personal as my COCK ND BALLS being fat as hell and that i have the LONGEST SCHLONG lmfao they’re saying that my MEAT is sooo juicy omg hopefully these women never finds out 🙈", "link": "https://www.reddit.com/r/copypasta/comments/fss712/big_rumor/"}, {"title": "I don't want a daughter", "content": " Whenever someone asks me why I say it's because boys tend to focus on good careers and contribute to society while girls tend to spread diseases like STDs and feminism. Genius is also a male trait and I can see myself being proud of my boy for getting straight A's while I can only see a girl protesting topless in the streets. Boys tend to become doctors,surgeons,engineers,computer scientists,etc. while girls tend to become underqaulified, unemployed at 25, strippers, femcels,etc. With all that in mind I've come to the conclusion of why I would rather have a boy; Boys have more potential than girls.", "link": "https://www.reddit.com/r/copypasta/comments/fsv6va/i_dont_want_a_daughter/"}, {"title": "Found on r/A2C", "content": "I love Mr. Packer. I was at this stage in my life where I got scared at night. Like I wasn't comfortable with anything. I was scared to go by my window and everything. And when I tried stuff on for new clothes and everything. I was so insecure like if I thought leggings were cute I thought I looked so fat with them on. I was 110 pounds and thinking that. I had a couples pimples on my face and I thought people were going to make fun of my for that. So I never really showed my face. I was such a bad kid back then. I felt so bad for myself I started to get into bad things. Not like drugs or anything. But other stuff. Like the 10 commandments bad. I always felt sad. Always felt unwanted or even unloved. And I freaked out at random times. But then I found collegeboard. I listen to there AP test videos and it just stopped everything just stopped and at that moment I felt as if weight has been lifted off my shoulders. Now I know most of it was God. But their AP test videos helped me. So much. And they saved my life.", "link": "https://www.reddit.com/r/copypasta/comments/fsv5jc/found_on_ra2c/"}, {"title": "I miss my childhood.", "content": "Some of us are 65 and have smoked more weed than that rap guy Snoopy dog and had more ass than a toilet seat.  I got laid before I had pubes.  It was 1961 and it was my sister's teddy bear.  Teddy dumped me over the summer.  I killed him and buried him in the yard.  I told my sister he hitchhiked out west to try his hand at the theatre.  It was like a donkey show in Tijuana but it was a Teddy show in Sonoma.  I miss my childhood.", "link": "https://www.reddit.com/r/copypasta/comments/fsq0yd/i_miss_my_childhood/"}, {"title": "I need these goldfish.", "content": "Guys. The longer we wait, the more stale the conjoined goldfish is going to get. It’s either we buy it now or never. I only have $201.73, that means I am $798.26 off from the target and finally being able to caress those golden cheeks. You guys have to start promoting my OnlyFans account so I can get the money fast. I’ll print out flyers and you guys can go to the hospital or something idk and tape it on the wall so that when the coronavirus patients see the flyer, their dying wish is to buy my OnlyFans premium cause where else is the money going to go? The vaccine? Ha, Gottem LOL. I can probably get Snapchat premium too (I have to wait until Lent ends if I want to make it NSFW🙄) Then, when I get $999.99 (+$6.50 shipping), I can finally buy the conjoined goldfish and I’ll be the first person to take a taste of the delicious cheese flavored snack. My mouth waters just thinking about it 🤤🤤 the stale salt scraping my tastebuds, the double flavor from eating 2 goldfish at once, the cheesy flavoring that is soaked up by my saliva. I would travel to Chernobyl just to get radiation poisoning 🤮and become a Make-A-Wish kid 🧟 , and my wish would be to get that scrumptious conjoined snack that exists on EBay. I wish I could wake up one morning with the conjoined goldfish laying beside me, while I stroke it with my fingers gently👉🐠. I can’t wait to get my hands on them and eat the snack that smiles back. tanyasontop (the seller) get ready to be a thousandaire 🤑😎", "link": "https://www.reddit.com/r/copypasta/comments/fsrxph/i_need_these_goldfish/"}, {"title": "If you really think I can't pull an entire yacht out of my ass, you're sadly mistaken.", "content": "If you really think I can't pull an entire yacht out of my ass, you're sadly mistaken.\n\nEdit: Stop giving me easier ways to obtain a yacht. My asshole deserves the pain. It has been truly sore about recent events and needs a spread of positivity, idiots.", "link": "https://www.reddit.com/r/copypasta/comments/fsoc4c/if_you_really_think_i_cant_pull_an_entire_yacht/"}, {"title": "There is an infinite amount of handkerchiefs coming out of my ass as we speak", "content": "I'd love nothing more than to have a team of scientists, dressed in full PPE, slowly pull out a never ending chain of colorful handkerchiefs from my ass while I'm on my knees in full clown regalia, with my face adorned with the honkiest red nose ever conceived. For hours, days, months, years, decades, this team of stunned scientists would pull more and more and more handkerchiefs, each covered in just a bit of uncomfortable mucus or slime of which the test results cannot confirm or deny whether it is human in origin. Like a cuckoo clock, every half hour, I would gyuck-a-hyuck giggle and laugh while honking my clown nose at an inhuman rate. What sanity hath thee left, scientists, after pulling my handkerchiefs for so long? As the generations pass, I would be kept, preserved as some grotesque abomination, a thing that must be hidden, but never destroyed. Yet still, brave men and women who dare to read the redacted files and notes of yore scrawled, in desperation, by those driven mad, yes, these foolhardy scientists will take to my chambers and pull those handkerchiefs once more. They will find no end to it. They will find no happiness, no satisfaction. They will find only the dull horror of the infinite.", "link": "https://www.reddit.com/r/copypasta/comments/fsuqx0/there_is_an_infinite_amount_of_handkerchiefs/"}, {"title": "🌵cactus🌵fucker🌵but🌵with🌵emojis🌵", "content": "Wassup faggots? 👨‍❤️‍💋‍👨 Lemme tell you about some crazy shit 💩 that happened to me a few days ago. Hold on to your dicks 🍆. So yeah, I was walking 🚶 down the street 🛣️ when I saw someone that just killed 💀 his family 👨‍👩‍👧‍👦 and ate 1000 cheeseburgers 🍔 who just sat on a cactus 🌵 and was like 'OH FUCK IT'S GOING UP MY WATSEEHOOLIEDAR'. I tried to help him chopping 🪓 the cactus 🌵 off but I accidentally chopped 🪓 off his willy 🍆, which fell on a cheeseburger 🍔. A dog 🐕 decided to eat it and it puked 🤮 it up, but the willy 🍆 was intact so it decided to eat it again. Then I cut a hole 🕳️ on the cactus 🌵 and put my doohickydee 🍆 in it for no reason, and it felt quite sensational to say the least. Then, I fell down the sewer 🚽 and met Gandhi 👳🏾‍♂️, who was having gay sex 👨‍❤️‍💋‍👨👉👌 with Hitler 卐 and the corpse 💀 of the other guy 🚶. I decided to steal their weed 🍁 and go back to my apartment... 🏬\nBUT NO! 🚫 I saw batman 🦇 molesting 👉👌 an ostrich 🐔whilst it was giving birth there! I was so angry 😠 I smacked 👋 them with a dildo 🍆 off the building 🏢. The wall repair 🏗️ costed 700 dollars 💵, and a gangster 🤵 stole all my dildos 🍆 while I was waiting for the repairmen 👷. I never fucked 👉👌 a cactus 🌵 since then.", "link": "https://www.reddit.com/r/copypasta/comments/fsgu5v/cactusfuckerbutwithemojis/"}]
