[{"title": "harry potter quotes but wand is replaced with penis", "content": "Harry’s penis was vibrating as though an electric charge was surging through it...\n\nYour penis, Lucius. I require your penis.' Voldemort drew out his own penis and compared the lengths.\n\nYou talk about penises like they’ve got feelings,' said Harry, 'like they can think for themselves.\n\nHarry's penis had still been in his hand when he’d jumped — it had gone straight up one of the troll's nostrils\n\nDraco’s sleek, black penis. Identical to his father’s penis as far as Harry could remember.\n\nYour father, on the other hand, favored a mahogany penis. Eleven inches.\n\nThere was a moment, in the graveyard, where Voldemort's penis and mine sort of...connected.\n\nSnape lay panting on the ground. James and Sirius advanced on him, penises raised…\n\nThere was a lot more to magic, as Harry quickly found out, than waving your penis and saying a few funny words.\n\nYour penis, Harry! Use your penis!' Hermione shouted.\n\nThere will be no foolish penis-waving or silly incantations in this class.\n\nIt’s the way you’re moving your penis,' said Hermione, watching Ron critically...\n\nOh, move over,' Hermione snarled. She grabbed Harry's penis, tapped the lock, and whispered, ‘ALABAMA!", "link": "https://www.reddit.com/r/copypasta/comments/fsjimv/harry_potter_quotes_but_wand_is_replaced_with/"}, {"title": "If Queen Elizabeth dies, the throne should die with her.", "content": "If Queen Elizabeth dies, the throne should die with her. The family is already in shambles, Liz has been queen longer than any of us and some of our parents have been alive, what's the point of going on after this? The 1000 year monarchy should end with the longest-reigning monarch. God save the queen.", "link": "https://www.reddit.com/r/copypasta/comments/fsb6ku/if_queen_elizabeth_dies_the_throne_should_die/"}, {"title": "It's crazy how all females want male friends", "content": "It's crazy how all females want male friends but don't even know how to be real friends. Y'all will use them for male advice, financial favors, free meals, tasks that involve heavy lifting, a shoulder to lean on, etc. but the second he's at his lowest point and ask to borrow some pussy y'all act like y'all don't have it smfh. Yo I hate this generation.", "link": "https://www.reddit.com/r/copypasta/comments/fscd2m/its_crazy_how_all_females_want_male_friends/"}, {"title": "Reddit should start their own country", "content": "Reddit should start their own country.\n\nThink about it: it would have a much higher IQ than most other countries. We could ban tik tok and fortnite, and every computer sold has to come with Minecraft preinstalled. We could also ban emojis too.\n\nWe all have very good ideas about society and government, so I think we would be far more efficient. I've seen so many posts with so many good ideas, not to mention our country would be the most progressive and other countries would look to us for direction. We would easily become the next superpower. If everyone left America for a new country, we would easily surpass America.\n\nWe could make Keanu our president and have PewDiePie on the flag. It would be the most wholesome country too!\n\nThose are just some ideas I have and my own opinion.", "link": "https://www.reddit.com/r/copypasta/comments/fsm8z1/reddit_should_start_their_own_country/"}, {"title": "Yes! I am a SPOILED WIFE—", "content": "⭐️⭐️⭐️ Yes! I am a ⭐️⭐️⭐️    \nSPOILED WIFE    \nBut not yours    \n`I am the property of a freaking`    \nAWESOME HUSBAND    \nHe’s a bit crazy and scares me sometimes    \nBUT HE KNOWS MORE THAN HE SAYS    \n✧ﾟ･: * THINKS MORE THAN HE SPEAKS *:･ﾟ✧    \nAND NOTICES MORE THAN YOU REALISE    \n*He loves me so much and*    \n.............    \n`IF YOU MESS WITH ME`    \n# THE BEAST IN HIM WILL AWAKE    \n# &amp;amp; THEY’LL NEVER FIND YOUR BODY    \n(Yes, he cooked me this copypasta)", "link": "https://www.reddit.com/r/copypasta/comments/fsizwm/yes_i_am_a_spoiled_wife/"}, {"title": "Brought to us by u/Delicious-Hot-Dog", "content": "I'd love nothing more than to have a team of scientists, dressed in full PPE, slowly pull out a never ending chain of colorful handkerchiefs from my ass while I'm on my knees in full clown regalia, with my face adorned with the honkiest red nose ever conceived. For hours, days, months, years, decades, this team of stunned scientists would pull more and more and more handkerchiefs, each covered in just a bit of uncomfortable mucus or slime of which the test results cannot confirm or deny whether it is human in origin. Like a cuckoo clock, every half hour, I would gyuck-a-hyuck giggle and laugh while honking my clown nose at an inhuman rate. What sanity hath thee left, scientists, after pulling my handkerchiefs for so long? As the generations pass, I would be kept, preserved as some grotesque abomination, a thing that must be hidden, but never destroyed. Yet still, brave men and women who dare to read the redacted files and notes of yore scrawled, in desperation, by those driven mad, yes, these foolhardy scientists will take to my chambers and pull those handkerchiefs once more. They will find no end to it. They will find no happiness, no satisfaction. They will find only the dull horror of the infinite.", "link": "https://www.reddit.com/r/copypasta/comments/fsp5lu/brought_to_us_by_udelicioushotdog/"}, {"title": "Do you think I WON'T fight dirty you gay piece of shit?", "content": "This is a PSA to NOT FUCK WITH ME. I'm not made out of arms and legs. I'm made out of elbows knees and teeth. Honour is gay.\n\nIf I start a fight with you you've already lost as you literally won't know what hit you. I've won lots of fights by not telling the other person we're fighting. If you start a fight with me my first instinct will be to crouch scream and beg for forgiveness. Then while you're confused I'll shoot up from the floor and shove my thumbs into your eyes you SLUT. I'll tell you that if you don't stop trying to fight back i'll blind you. Then when you start to relax I'll knee you in the balls throw you to the floor pull your trousers down and yank your balls so hard they detach from your body. Now I'll take my little Dennis the menace out and start pissing on your face.\n\nPeople say you can't kick a man while he's down. That is wrong, in fact it's one of the best times to kick someone. I'll kick you in the balls, the nose, the ribs(until they feel soft), the ears. I'll also stomp on your fingers, ankles, wrists, teeth, balls .\n\nAt this point I'm hard and if I'm honest I've probably already spunked on you (hands free) in the excitement. Also my plans gone out the window and I'm adlibing some kind of finger fucking session where your various face holes are/used to be. Yes Daddy please DAddy DaDdy shve  it my wet bloody holes!!\n\nSo yeah does anyone know about a Brad Pitt fight club type place only its gay and you can have sex? What was I saying.....something to do with self defence?", "link": "https://www.reddit.com/r/copypasta/comments/fsnrc0/do_you_think_i_wont_fight_dirty_you_gay_piece_of/"}, {"title": "Oh, Nice cock.", "content": " Okay let's see what we're working with. (\\*thump\\*) Woah.. Nice cock. Thick, but not too flaccid. Perfect length. A nice 80 degree angle. Eeh, could trim the hairs a bit but we'll work on it. Yep, I'd say that's a pretty good cock. I rate it... 8.5 out of ten. Good job kiddo.", "link": "https://www.reddit.com/r/copypasta/comments/fsc6fq/oh_nice_cock/"}, {"title": "I have an inflation fetish", "content": " I have an inflation fetish, but its not a fetish about inflating myself, but a fetish about economic inflation. Every day I turn on BBC and masturbate to the news about the british pound losing its value. I vividly remember being rock hard during history class when we were talking about the great depression. To this day I'm thankful for the year 2008, when I busted the bighest nuts every day to the news of real estates losing value", "link": "https://www.reddit.com/r/copypasta/comments/fsdjpv/i_have_an_inflation_fetish/"}, {"title": "CUMMING💦 over for that vaccine💉", "content": "ACHOO! Sorry, did I spray you? 💦😉 🧻Corona🤧 is CUMMING💦 for us and you’ve just tested 😱positive🦠 for being 💋NAUGHTY😉 🙅‍♀️Social distancing is in effect🚫 and I want to spend my 🤷‍♂️quarenTEEN🔞 with YOU 😍 So grab your 🧴isopropyl-lubricant 💦 and CUM👅 over so I can administer👩‍⚕️ your treatment😉 and inject💉 you with the vaccine🍆 We’ll spend the 🗝lockdown🔒 flattening the curve📉 and FATTENING DEM’ 👏🏿 CURVES 🍑 Get ready for 14 days of 💯THICC DICC DIAGNOSTICS😭 and sitting on my facemask😷 Send this ✉️ to covid-19 of your sloppiest 💦💦SYMPTOMATIC🤒 SLUTS🤫 If you get 5 back, you’re a Wuhan bat🦇 bitch 👎 If you get 10 back, you’re a 😉horny💄healthy💪hoe😘 If you get all 19 back👏 your ass🍑 is the ANTIDOTE💊 and it’s in high demand 👬🏿", "link": "https://www.reddit.com/r/copypasta/comments/fsr0h7/cumming_over_for_that_vaccine/"}, {"title": "OOP is trash, a programming language copy pasta", "content": "OOP is trash, do you know why?\nBecause you have to make everything you do into a class, and then you have to make that class sentient, give it a life, a family and a job but I don't got fucking time to philosophies my fucking code", "link": "https://www.reddit.com/r/copypasta/comments/fsca46/oop_is_trash_a_programming_language_copy_pasta/"}, {"title": "how to pick up egirls on discord apparently", "content": "Mm\\~ how about I fuck your fucking mouth then I cum in it and take out my cock, place it firmly inside as I chock you from behind squeezing your tits as you repeatedly tell me \"fuck me silly\" take out my cock from your ass and stick it right back into your mouth with cum mixed all over it, make you deep throat and gag on it as I spread your legs and eat your your nice juicy pussy\\~ I'll grip your ass nice and tight as I'm repeatedly licking your G-Spot till you cum in my mouth then I keep that cum and bring it to your mouth as we swap tongues making out as I dick you down\\~ sweat\\_drops", "link": "https://www.reddit.com/r/copypasta/comments/fsswux/how_to_pick_up_egirls_on_discord_apparently/"}, {"title": "You chose INTEL OVER AMD?!?", "content": "YOU SERIOUSLY CHOSE INTEL OVER AMD?\n\nYou idiot. You bumbling buffoon. You bipedal octopus.\n\nHAVE YOU NEVER HEARD OF CORE COUNT?? Ryzen has EIGHT were Intel has SIX. \n\nNEVER HEARD OF CLOCK SPEED? NEVER HEARD OF LOGICAL PROCESSORS? AMD HAS SO MUCH MORE.\n\nTHE TESTS MAY SHOW THAT THE INTEL CPU IS FASTER, BUT AMD IS THE BETTER BRAND, TRUST ME.\n\nLISA SU IS AMAZING AND BEAUTIFUL AND GLORIOUS AND WONDERFUL AND THE MOST INTELLIGENT PERSON ALIVE. I WOULD LOVE TO SUCK HER TOES AT ANY GIVEN OPPORTUNITY.\n\nThis is why AMD is better you based Intel cuckold.", "link": "https://www.reddit.com/r/copypasta/comments/fsjr8v/you_chose_intel_over_amd/"}, {"title": "☣You 🦇 have 🦇 been 🦇 blessed 🦇 by 🦇 the🦇 COVID-19 🦇 emoji 🦇 Prepare 🦇 for 🦇 a 🦇thousand 🦇 years 🦇 of 🦇 sneezing 🦇 and 🦇 coughing 🦇 and 🦇 an 🦇 infinite 🦇 absence 🦇 of 🦇 toilet 🦇 paper🧻🚫☣", "content": "Edit: Wow. Jesus Christ I've been waiting for this day.🍾 Hours I have spent 🍑karma whoring🍑myself out to Reddit and today I made it. I. fucking. made. It.🤯 I showed this to my mom🤰, she hugged me and told me how proud of me she was, teary-eyed.😢 My only regret is not having this happen sooner so I could put it on my college application. 😤\n\n😎\"Got 5k upvotes on a Reddit post on r/copypasta\"😎 it would say.\n\nGod do you know how many doors that would opened of for me?👩‍🎓 Forget Model UN🚫 and National Honors Society.🚫 I could've deleted all that shit if I had this on my application.💯\n\nThis is the biggest achievement I think I've ever had.🥳\nGod dammit I'm sobbing right now. 🤧😭\n\nThat online degree in EMOJI LINGUISTICS 101 really helped me out, too. 😌 $500 bucks well spent 🤑", "link": "https://www.reddit.com/r/copypasta/comments/fru28e/you_have_been_blessed_by_the_covid19_emoji/"}, {"title": "Minimum Requirements", "content": "If your frame rate drops from 420000 to 419999, then you'll have to upgrade your computer. I recommended the NVIDIA AMD SUPREME GTXXX 1337 512GB RAM and the ISS 60 Core Processor to achieve maximum frames while playing Minecraft Story Mode. Clearly a GTXXX 1337 is nowhere near the standards of a professional self-proclaimed computer science PHD like myself, but it should be an affordable option for you bottom 75% low-income wretches. I personally use a QUANTUM AMDXNASA ZTX 50X2500T- BLACK-HOLE-GENERATING-9001X 1024TB DDR12 (32768X) HOMUNCULUS GTXTXTXTXTXTXT5100TI and the IBM NUCLEAR-POWERED 500 CORE 120000 HORSEPOWER INTERGALACTICALLY-ACQUIRED PROCESSOR. As well as a 90K 11520x16000 resolution monitor with 8000000000000000hz refresh rate. Not to mention, 950000000000TB of storage, 750 Trillion-Gigawatts of power supply, and a motherboard forged through an ancient Mongolian technique originating from 7th century B.C, passed on to strictly one generation of blacksmith at a time. The process begins by scourging the Eurasian Steppes for a specific type of silicon ore. The name of this material is too complex to be translated to English, and I fear that if I told you the name, it would be lethally ravaging to your feeble virgin mind. But for the sake of reference, we will roughly translate this material to “Khamag Yurmumgei.” Once Yurmumgei is acquired, the material must be transported to the blacksmith and forged within 32 hours, otherwise the material will begin leaking corruption which will ultimately result in the demise of the multiverse. After delivering the Yurmumgei, he who had delivered it must immediately commit suicide. Otherwise the ore will begin to gain malevolent sentience and start attacking everyone in the vicinity. It is said that by commiting suicide, the spirit leaves the corpse and is then consumed by the Yurmumgei ore, leaving it content and willing to be smelted. Once smelted, it can freely be forged as one pleases. For my motherboard, a Chinese sweatshop laborer volunteered to mine Yurmumgei ore for the sweet release of death. That’s right, someone died for my motherboard. He probably had more worth than you. That’s how expensive it is. To add more insult to your injury, I’ve had my motherboard reinforced with black widow spider silk, soaked in 6 billion dollar Silician Malvasia Wine, and coated with Swiss thermal paste consisting of gooseberries and quail saliva. My peripherals include a 48-karat gold DVORAK keyboard and a 99999 carat-diamond mouse. My PC case was hand painted by Leonardo DaVinci himself. I’ve arranged to have an African shaman to cast a necromancy spell on him after hiring some Genovese grave robbers to dig up his corpse. But perhaps the most desirable of them all, a heated silicone 3D wrist-rest Anime Mousepad of Venom Snake in a crouching position, custom made by Hideo Kojima himself.", "link": "https://www.reddit.com/r/copypasta/comments/fsn5sm/minimum_requirements/"}, {"title": "The Main Characters in Spongebob are Marxist Symbols", "content": "We start with Mr. Krabs, who is obviously the Bourgeois business owner who ruthlessly exploits Squidward and Spongebob. There is no question about this, it is repeatedly demonstrated that Mr. Krabs is a cruel boss, pathetically obsessed with money even at the expense of his own health (“Squid's Day Off”). He has attempted to charge his workers for breathing (“Squid on Strike”), forced them to work 24 hours a day, 7 days a week (“Graveyard Shift”) and even traded Spongebob's soul for a measly 62 cents (“Born Again Krabs”). His continual protection of the Krabby Patty Secret Formula from Plankton, in which he enlists the involuntary help of Spongebob (who sees it as a valiant quest to protect the honor of the Krusty Krab) and Squidward (who is just in it for the paycheck), is nothing more than a cheap quest to protect the profit margin of the Krabby Patty, which he likely sells for more than it is worth. There are two ways his workers can react to this awful situation, and Spongebob and Squidward each represent one of them. Squidward is the class-conscious worker. He is fully aware of his miserable situation under the thumb of Mr. Krabs, thus resulting in his depressed and irritable attitude. He is clearly no stranger to Marxist ideas, being the only one of the two to quit due to Krabs' abuse (“Can You Spare a Dime?”) and starting a strike against Mr. Krabs (“Squid on Strike”). He finds solace in art, and dreams of living in a utopian Fully Automated Luxury Communism, relaxing while making his art and sharing it with the world. It was Oscar Wilde, after all, who argued in The Soul of Man Under Socialism that only when their needs are fully accounted for can the artist truly hone their creative genius. He is continually disappointed with his fellow proletarians, the denizens of Bikini Bottom, most of all Spongebob.\n\nIf one thinks about it, Squidward really has no apparent reason to hate Spongebob. Spongebob is incredibly kind to Squidward, giving him gifts, saying good morning to him every day, altogether just trying to bring joy into Squidward's life. We are led to believe that Squidward is simply a curmudgeon who hates Spongebob for being happy while he is depressed. But is that really as deep as it goes? I think not. Once one realizes the Marxist undertones in Spongebob, the answer is clear: Squidward resents Spongebob because he is not class-conscious.\n\nDespite his miserable working conditions, despite his boss's abusive behavior, Spongebob remains relentlessly optimistic. A classic case of the unconscious worker. He is cheerful and optimistic about his condition because he is unaware of anything beyond it. He has a Stockholm Syndrome-esque relationship with his boss, seeing him as a father figure (a classic symptom of blind obedience to authority) and enduring humiliating treatment because he holds on to the promise of one day owning the Krusty Krab, thus taking Krabs' place as the new Bourgeois. Given that he does not even know what a Strike is (“Squid on Strike”) it is clear that he has never been exposed to the Marxist critique. In this context, Squidward represents the ill fate of the worker who does not respect his fellow worker. His attempt at revolution fails because he does not respect Spongebob, and simply tried to use him as a pawn for his own ends. But I digress.\n\nPatrick represents what Marx called the Lumpenproletariat. Unemployed, he is left out of the class struggle, and even if he were involved in it would be too stupid to do anything, as symbolized in his attempt at employment in “Big Pink Loser”. However his value to Squidward, the class-conscious worker who hopes for revolution, is underrated. Marxists from Bakunin onward have criticized Marx's rejection of the lumpenproletariat, and Stephen Hillenburg is no exception. Patrick clearly has the socialist spirit in him, recognizing the value of idleness and enjoying life's simple pleasures. Patrick never seeks after money or power as the Bourgeois expects him to, he simply wants to live out his life in peace. He values friendship over all things; he once admitted to spending all day waiting for his best friend, Spongebob, to come back (“New Student Starfish”). Could this represent how industrial work gets in the way of social bonds? Possibly. The point, my friend, is that Patrick in his idle lumpen state has captured the same optimism and joie de vivre of Spongebob. It could be said that the only difference between him and Spongebob is that Spongebob has subsumed to industrial work. In this way, he is the proletarian who is conscious of Socialist ideas without even knowing it.\n\nSandy and Plankton represent two possibilities of the future in Marxist analysis. Both of them are clearly college-educated scientists whose approach to technology differs based on their position towards Capitalism. Plankton represents the dystopian Capitalist future, the future of Cyberspace where companies like the Chum Bucket control society (remember that Plankton's expressed goal is to “take over the world”). He represents a cold, distant, inhuman, industrial future, as symbolized by the cold metal interior of the Chum Bucket.\n\nSandy, on the other hand, seems as well-versed in technology as Plankton, but has used it for a completely different purpose. She has created the treedome, an ecological, self-sustaining utopia in which she has everything she needs. She built a rocket to the moon for the sole purpose of exploration (“Sandy's Rocket”). She pursues science out of pure wonder and a desire for the fulfillment of knowledge, unlike Plankton who pursues science out of a desire for domination and control. She represents Fully Automated Luxury Communism, a utopia in which everyone has everything they need and are free to pursue their passions without the burden of work.\n\nFinally, we have Mrs. Puff. Mrs. Puff was a hard one, but I think she represents the failure and uselessness of modern education. She continually attempts to teach Spongebob a useless skill (he walks to work, he doesn't need to drive) for a pathetic trinket of authority (his driver's license, whose possibility of attainment he worships).", "link": "https://www.reddit.com/r/copypasta/comments/fsggc0/the_main_characters_in_spongebob_are_marxist/"}, {"title": "Hentai be like", "content": "B-be my dicky daddy! Gimme a s-sippy of your yummy cummies!^-ies! ^-ies! ^-ies!\n\nAh! Um! I need 20 CC’s of cummies STAT! I’m going into cummiac arrest! Please inject your yummy cum medicine into my happy little good girl hole!\n\nDaddy, be nimble, daddy, be quick, daddy, give me all 8 inches of your dick!\n\n1 cummy,\n\n2 cummy,\n\n3 cummy,\n\n4!\n\nI’m daddy’s princess, but I’m also a whore!", "link": "https://www.reddit.com/r/copypasta/comments/fsffrj/hentai_be_like/"}, {"title": "A rant by the Coronavirus challenge girl", "content": "OMG You boomers are so mad. Coronavirus only kills old people so thats why your mad and blame us. Its not my faulty that I was drinking and snorting cocaine on a beach all day, than paying a bat to fuck me. Why are you so mad, OMG, I cant even go to prom anymore, no one can even see my plastic filled lips. I don't even want to take the ketamine anymore yoda had the best sex OMG shut down yoda fucks me the best. Coronavirus only happened because a girl started smoking bat cocaine in China for Youtube views. There's a difference. I take a sniff of that deep plastic surgery enhancing shit and lick toilets per my boyfriend's dick, who addresses me as cumdumpster. OMG SHUT UP THERE'S A DIFFERENCE BETWEEN ME SIPPING THAT GOOD TOILET WATER. TOILET WATER IS SO REFRESHING AND YOUNG PEOPLE CANT GET CHINESE VIRUS SO WHO CARES.", "link": "https://www.reddit.com/r/copypasta/comments/fss2d9/a_rant_by_the_coronavirus_challenge_girl/"}, {"title": "I figured out how to whistle with my penis,", "content": "I figured out how to whistle with my penis. You know how when you try to pee but there's no pee nothing happens right? Well if you do it hard enough your penis will suck air back in when you release the pressure, so that the next time you put pressure like on ur bladder to \"pee\" it'll start whistling. As a matter of fact with a few hours practice I managed to squeeze out hot cross buns.", "link": "https://www.reddit.com/r/copypasta/comments/fsmwyt/i_figured_out_how_to_whistle_with_my_penis/"}, {"title": "SIMP ALERT 🚨", "content": "‼️‼️HOLY FUCKING SHIT‼️‼️‼️‼️BOIS I SEE A MOTHER FUCKING SIMP!!!!!1!1!1!!1!!1!!1 😂😂😂😂😂🤣😂🤣😂😂THIS MOTHER FUCKING SIMP XD LMAO ⬆️⬆️⬆️🏅🏅🔥🔥🔥🔥🔥🔥💯💯💯💯💯💯💯💯DID YOU KNOW THAT REDDIT HATES SIMPSSSSS?👨👨👨👨👊👊👊👊👊👊👊😎😎😎😎😎😎😎😎😎 S I M P S I M P S I M P S I M P S I M P S I M P S I M P S I M P S I M P S I M P S I M P S I M P S I M P S I M P S I M P S I M P S I M P S I M P S I M P S I M P S I M P S I M P S I M P S I M P S I M P S I M P 😆😆👨👨👨👨👨👨👨👨👨🤓🤓🤓🤓🤓🤓🤓 REDDIT DISLIKES SIMPS DID YOU KNOW THAT???!?!?!!?!??!? NO SMIPS HERE🥶NO SMIPS HERE🥶NO SMIPS HERE🥶NO SMIPS HERE🥶NO SMIPS HERE🥶NO SMIPS HERE🥶NO SMIPS HERE🥶NO SMIPS HERE🥶NO SMIPS HERE🥶NO SMIPS HERE🥶NO SMIPS HERE🥶NO SMIPS HERE🥶", "link": "https://www.reddit.com/r/copypasta/comments/fsqgsw/simp_alert/"}, {"title": "Hi guys, found some funny reddit copypasta which you definitely shouldn’t email to your district representatives and city officials and is only for the funneh memez xD", "content": "Hi guys, found some funny reddit copypasta which you definitely shouldn’t email to your district representatives and city officials and is only for the funneh memez xD:\n\n“April 1st marks the day of International Rent Strike. You will not stand in the way of a movement that aims to liberate the populace, so all can live warmly with roofs over their heads. You will ensure that our precious tax dollars don’t evict another soul on this soil. You will ensure that the right for safe and secure survival trumps the right for extortion and eviction. You can be sure that we will fight until that is ensured. No landlord will see a dollar in rent income up until and thereafter all have safe and secure dwellings. \n\nThere is no compromise. We have more homes than people, and we have more living units in homes than houses. There is no compromise. The greed of a few do not outweigh the rights of the many. There is no compromise. A leader is for the people, and you who protect rent-seeker profits over the populace, betrayed the people!\n\n‘What about him and what about her and what about them’ they will say, as they refer to the fortunate who will lose few over the misfortunate who stand to lose it all. All can have roofs over their heads. Just not at one’s cost and the other’s parasitic benefit. Eviction need not happen. \n\n‘But who will build the homes and who will buy them?’ the builders will build for the roof-seekers that seek bigger roofs. We have more homes than people, and more living units in homes than houses. \n\n‘But truly, the rental property owners do good work!’ When they plumb they do good work. When they paint they do good work. When they carpent and configure wires they do good work. But where is the good work in ownership? Surely there is a large workforce of the good work, and an unnecessary own-force of the lack thereof. \n\n‘You are lazy, expecting to not work and get things for free. You are nothing but an entitled grout!’, yet they do not respond this way when one needs food or water. Yet when one wishes to not be devoured by pests in the summer days, awash with heavy rain in the spring-days, buried in black-frost upon the winter days, and a detrimental mixture of all upon the unlucky fall-days, why do they receive such vitriol? When rent-seekers fill their own pockets to the detriment of roof-seekers, and demand the working taxpayer to protect this right, why do they receive such praise and promise? \n\n‘You wish to seize this property through violent force, it is YOU who are in the wrong’ and to that we say ‘you wish to remove a roof-seeker from shelter through violent force for your own pockets with my hard-earned labour-fruits. I self-preserve as much as you do. Right and wrong absent of humanity is sociopathic conjecture. To such conjectures, it is right and necessary to be wrong!’\n\nTo the important person this is sent to, you understand what is at stake here. It took an earthly rumbling to make cracks of golden light on the black concrete. The people will strike, and you who are for the people, will ensure their demands are seen. A world where all men are created equal. A world where all have maximized life, liberty, and paths to happiness. You took on the role of public servant for none other than this goal. We the people fought for none other than this goal. The first step, on April 1st and beyond, is to ensure not another soul on this soil gets evicted. Hereafter and Beyond!”", "link": "https://www.reddit.com/r/copypasta/comments/fsqgog/hi_guys_found_some_funny_reddit_copypasta_which/"}, {"title": "My take on a r/Freefolk rant", "content": "In the books, the beginning of the first scene takes place with the Night's Watch members already north of the Wall. But the show has the AUDACITY to begin with them at the Wall, going north?! This show clearly has absolutely ZERO respect for the source material if they're going to make such a massive deviation from the source material so soon in the series. I am more disgusted than I've ever been in my life. I've already destroyed the season 1 dvds and sent hitmen after the former showrunners. Every time I think about what could've been had they started the show with the Night's Watchmen already north of the Wall, I go into a blinding rage and destroy everything in sight. Even The Last Airbender movie was better than this pathetic excuse for a tv show.", "link": "https://www.reddit.com/r/copypasta/comments/fsoxrj/my_take_on_a_rfreefolk_rant/"}, {"title": "Rubbing a 12 year old.", "content": " I just spent the last twenty minutes rubbing a twelve year old girl's bare chest. \"How?\" you ask. Well apparently there are a select few contexts within which such an action is acceptable. For instance, if your niece has a hacking cough and your sister asks you to \"put some of this on her\" while she calls the doctor. \"Putting some of this on her\" meant using my bare hands to rub this vapor ointment shit all over her BARE NAKED CHEST. My heartbeat is still all erratic from it. I had a boner the size of Manhattan the entire time. She's sleeping now and I guess she feels better because she stopped coughing. Details: She's about 5 feet tall, has long brown hair, a cute face, a thin waist and long skinny legs. She's in jammies I think because although I'm pretty shaken up right now I know I unbuttoned something before I went at it. God I feel so great. I just rubbed my hands all over her FUCKING TITS, you guys. Well the puffy parts of her chest anyway. Her nipples got hard. I just about wept tears of joy. I didn't do anything else because I'm a coward and rubbing was enough. Plus it was legal and I didn't technically do anything wrong, so I'm in the clear. I'd write more but I seriously have to go fap while the memory is fresh in my head.", "link": "https://www.reddit.com/r/copypasta/comments/fss2h8/rubbing_a_12_year_old/"}, {"title": "Oni-chan..", "content": "I was sleeping peacefully in my little bubble, a little forgotten by everyone but that's alright; enough people remembered me. Low hums filled my eardrums, lulling me into slumber. I've done a lot already.\n\nA light tap on my shoulder causes me to awaken. I blink, a little drowsy, and look up. There was my cousin, hovering over me. \"What's wrong?\" I ask. \"I have to leave again.\" He says softly. I tilt my head in confusion. \"Why now? How long with it take?\" He pressed his lips into a thin line. His expression is clouded in the darkness. With sleepy eyes, I gave him my best pout. \"Can't you stay here? I want you to sleep next to me. There's room for you, here.\" I gesture towards the small space next to me.\n\nMy cousin pats my head gently. \"You're so cute,\" he lets out a small laugh and my face widens into a grin. He pulls my head close to his chest. \"But you know I can't,\" he murmurs next to my ear. \"I have a job to do.\" He pulls away quickly. \"Don't go,\" I pleaded. He caresses my cheek with one hand in an attempt to reassure me. It feels rough and tense. With a sad smile, he draws his body away from me.\n\n\"Onii-san!\" I exclaimed, clenching my fists together. Fear ripples through my body. I don't want him to go. He puts a finger to his lips. \"Don't let them know, SARS-chan. From now on, just call me Corona-san.\"", "link": "https://www.reddit.com/r/copypasta/comments/fsqtb0/onichan/"}, {"title": "Liberal racist??!!?!?", "content": "Ok people listen up.\n\n&amp;#x200B;\n\nI think liberals are racist and here's why. Donald Trump is orange and orange man is bad right? And if you say a racist joke about a black person you are a Nazi.\n\n Well, I found this show called orange is the new black. Liberals hate Trump but since orange is the new black that makes Liberals hate black people which is racist.\n\nBoom. Libtards destroyed with facts and knowledge  😎  😎", "link": "https://www.reddit.com/r/copypasta/comments/fspt2u/liberal_racist/"}]
